#ifndef UE4SS_SDK_Majesty_HPP
#define UE4SS_SDK_Majesty_HPP

#include "Majesty_enums.hpp"

struct FAISACCtrlParam
{
    FString AISACName;                                                                // 0x0000 (size: 0x10)
    float fVolume;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FAbilityDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 AbilityID;                                                                  // 0x000C (size: 0x4)
    FName DisplayName;                                                                // 0x0010 (size: 0x8)
    FName Detail;                                                                     // 0x0018 (size: 0x8)
    TSoftClassPtr<AActionCommandBase> CommandActor;                                   // 0x0020 (size: 0x28)
    EABILITY_TYPE AbilityType;                                                        // 0x0048 (size: 0x1)
    EABILITY_USE_TYPE AbilityUseType;                                                 // 0x0049 (size: 0x1)
    bool AlwaysDisable;                                                               // 0x004A (size: 0x1)
    EATTRIBUTE_TYPE Attribute;                                                        // 0x004B (size: 0x1)
    bool DependWeapon;                                                                // 0x004C (size: 0x1)
    EWEAPON_CATEGORY RestrictWeapon;                                                  // 0x004D (size: 0x1)
    EBATTLE_TARGET_TYPE TargetType;                                                   // 0x004E (size: 0x1)
    bool ExceptEnforcer;                                                              // 0x004F (size: 0x1)
    EABILITY_COST_TYPE CostType;                                                      // 0x0050 (size: 0x1)
    int32 CostValue;                                                                  // 0x0054 (size: 0x4)
    int32 HitRatio;                                                                   // 0x0058 (size: 0x4)
    int32 CriticalRatio;                                                              // 0x005C (size: 0x4)
    int32 CriticalPower;                                                              // 0x0060 (size: 0x4)
    int32 AbilityRatio;                                                               // 0x0064 (size: 0x4)
    int32 BaseCount;                                                                  // 0x0068 (size: 0x4)
    int32 MinimumCount;                                                               // 0x006C (size: 0x4)
    int32 RandomCountMin;                                                             // 0x0070 (size: 0x4)
    int32 RandomCountMax;                                                             // 0x0074 (size: 0x4)
    EBATTLE_ACTION_ORDER_ESTIMATE_TYPE EstimateOrderType;                             // 0x0078 (size: 0x1)
    int32 EstimateOrderCount;                                                         // 0x007C (size: 0x4)
    TArray<FAilmentHandler> Ailment;                                                  // 0x0080 (size: 0x10)
    bool KeepBoostEffect;                                                             // 0x0090 (size: 0x1)
    bool EnableItemAll;                                                               // 0x0091 (size: 0x1)
    bool EnableSkillAll;                                                              // 0x0092 (size: 0x1)
    bool EnableConvergence;                                                           // 0x0093 (size: 0x1)
    bool EnableDiffusion;                                                             // 0x0094 (size: 0x1)
    bool EnableReflection;                                                            // 0x0095 (size: 0x1)
    bool EnableCounter;                                                               // 0x0096 (size: 0x1)
    bool EnableHideOut;                                                               // 0x0097 (size: 0x1)
    bool EnableRepeat;                                                                // 0x0098 (size: 0x1)
    bool EnableCover;                                                                 // 0x0099 (size: 0x1)
    bool EnableProvoke;                                                               // 0x009A (size: 0x1)
    bool EnableDisableMagic;                                                          // 0x009B (size: 0x1)
    bool EnableEnchant;                                                               // 0x009C (size: 0x1)
    bool EnableChaseAttack;                                                           // 0x009D (size: 0x1)
    bool EnableWeakCheckAll;                                                          // 0x009E (size: 0x1)
    bool EnableNormalAttackAll;                                                       // 0x009F (size: 0x1)
    bool EnableSession;                                                               // 0x00A0 (size: 0x1)
    bool EnableBusinessSupport;                                                       // 0x00A1 (size: 0x1)
    bool EnableForceWeakness;                                                         // 0x00A2 (size: 0x1)
    bool EnableNoUseMaterial;                                                         // 0x00A3 (size: 0x1)
    bool EnableSwitchWeapon;                                                          // 0x00A4 (size: 0x1)
    bool EnableCompensationMagic;                                                     // 0x00A5 (size: 0x1)
    bool EnableExcitement;                                                            // 0x00A6 (size: 0x1)
    bool SongAbilityFlag;                                                             // 0x00A7 (size: 0x1)
    bool DanceAbilityFlag;                                                            // 0x00A8 (size: 0x1)
    bool EnableAutoTameMonster;                                                       // 0x00A9 (size: 0x1)
    bool UseAbilityCamera;                                                            // 0x00AA (size: 0x1)
    TSoftObjectPtr<ULevelSequence> ActionCommandSequencer;                            // 0x00B0 (size: 0x28)
    TArray<FName> AbilitySE;                                                          // 0x00D8 (size: 0x10)
    int32 SlideFrame;                                                                 // 0x00E8 (size: 0x4)

}; // Size: 0xF0

struct FAbilitySetDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 AbilitySetID;                                                               // 0x000C (size: 0x4)
    FName NoBoost;                                                                    // 0x0010 (size: 0x8)
    FName BoostLv1;                                                                   // 0x0018 (size: 0x8)
    FName BoostLv2;                                                                   // 0x0020 (size: 0x8)
    FName BoostLv3;                                                                   // 0x0028 (size: 0x8)
    ECOMMAND_MENU_TYPE MenuType;                                                      // 0x0030 (size: 0x1)
    ECOMMAND_SUB_MENU_TYPE SubMenuType;                                               // 0x0031 (size: 0x1)
    EABILITY_ICON_TYPE MenuIconType;                                                  // 0x0032 (size: 0x1)
    int32 MenuInfoLv;                                                                 // 0x0034 (size: 0x4)
    FName SuperMagicLabel;                                                            // 0x0038 (size: 0x8)
    FName HyperMagicLabel;                                                            // 0x0040 (size: 0x8)
    FName RestrictWeaponLabel;                                                        // 0x0048 (size: 0x8)
    bool IsDivineAbility;                                                             // 0x0050 (size: 0x1)
    int32 InventorTurn;                                                               // 0x0054 (size: 0x4)
    TArray<bool> CommandSealingSwitch;                                                // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FAchievementData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EAchievementType AchievementType;                                                 // 0x000C (size: 0x1)
    int32 IntParam;                                                                   // 0x0010 (size: 0x4)
    FName NameParam;                                                                  // 0x0014 (size: 0x8)
    TArray<int32> IntParams;                                                          // 0x0020 (size: 0x10)
    TArray<FName> NameParams;                                                         // 0x0030 (size: 0x10)
    bool IsPlatinumAchievement;                                                       // 0x0040 (size: 0x1)
    FName Key_PS4;                                                                    // 0x0044 (size: 0x8)
    FName Key_PS5;                                                                    // 0x004C (size: 0x8)
    FName Key_Steam;                                                                  // 0x0054 (size: 0x8)

}; // Size: 0x60

struct FAchievementSaveData
{
    TMap<MJFieldCommandType, int32> FieldCommandSuccessCount;                         // 0x0000 (size: 0x50)
    TArray<int32> SwoonNpcUniqueIds;                                                  // 0x0050 (size: 0x10)
    int32 LinerShipCount;                                                             // 0x0060 (size: 0x4)
    TMap<EBOOST_LEVEL, int32> BosstAttackCount;                                       // 0x0068 (size: 0x50)
    int32 BreakCount;                                                                 // 0x00B8 (size: 0x4)
    int32 MaxDamageValue;                                                             // 0x00BC (size: 0x4)
    int32 AcquisitionAbilityCount;                                                    // 0x00C0 (size: 0x4)
    int32 AcquisitionAdvancedAbilityCount;                                            // 0x00C4 (size: 0x4)
    int32 AcquisitionDevineAbilityCount;                                              // 0x00C8 (size: 0x4)

}; // Size: 0xD0

struct FAchievementTypeData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<FName> ExcludeEnemyGroups;                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAcqListViewWidgetEventPayload
{
    int32 SelectedIndex;                                                              // 0x0000 (size: 0x4)
    class UAcqListViewEntryItemBase* SelectedEntryItem;                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAcqManagerData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString BaseClassPath;                                                            // 0x0010 (size: 0x10)
    TSoftObjectPtr<UObject> InstancePath;                                             // 0x0020 (size: 0x28)
    EMANAGER_CREATE_PHASE CreatePhase;                                                // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FAcquisitionAbilityData
{
    TArray<bool> AcquisitionFlag;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FActionDelaySEData
{
    int32 DelayFrame;                                                                 // 0x0000 (size: 0x4)
    FName PlaySEID;                                                                   // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FActionOrderData
{
    EACTION_ORDER_TYPE m_eOrderType;                                                  // 0x0000 (size: 0x1)
    float m_fDelayRatio;                                                              // 0x0004 (size: 0x4)
    class UActionOrderIcon* m_cCurrentOrderIcon;                                      // 0x0008 (size: 0x8)
    class UActionOrderIcon* m_cNextOrderIcon_DEPLICATED;                              // 0x0010 (size: 0x8)
    class ABattleCharacterBase* m_cOrderCharacter;                                    // 0x0018 (size: 0x8)
    class ABattleCharacterBase* m_cSubOrderCharacter;                                 // 0x0020 (size: 0x8)
    bool m_bUseIcon;                                                                  // 0x0028 (size: 0x1)
    int32 m_nCurrentIndex;                                                            // 0x002C (size: 0x4)
    int32 m_nNextIndex;                                                               // 0x0030 (size: 0x4)
    int32 m_nOrderCount;                                                              // 0x0034 (size: 0x4)
    bool m_bIsOrderChange;                                                            // 0x0038 (size: 0x1)
    bool m_bIsOrderBuff;                                                              // 0x0039 (size: 0x1)
    bool m_bSaved_IsOrderChange;                                                      // 0x003A (size: 0x1)

}; // Size: 0x40

struct FActivityData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName TitleText;                                                                  // 0x000C (size: 0x8)

}; // Size: 0x18

struct FActivitySubTaskData
{
    FName SubTaskLabel;                                                               // 0x0000 (size: 0x8)
    FName MainStoryLabel;                                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FActivityTaskData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 ActivityLabelId;                                                            // 0x000C (size: 0x4)
    TArray<FActivitySubTaskData> SubTaskData;                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAddBalloonParam
{
    FTalkText Text;                                                                   // 0x0000 (size: 0x60)
    TArray<FName> VoiceLabel;                                                         // 0x0060 (size: 0x10)
    class AActor* TargetActor;                                                        // 0x0070 (size: 0x8)
    FVector2D Offset;                                                                 // 0x0078 (size: 0x8)
    bool EnableTail;                                                                  // 0x0080 (size: 0x1)
    FVector2D UnderOffset;                                                            // 0x0084 (size: 0x8)
    EEventBalloonDir BalloonDir;                                                      // 0x008C (size: 0x1)
    float BalloonOffsetScale;                                                         // 0x0090 (size: 0x4)
    EBALLOON_TEXT_POS TextPosition;                                                   // 0x0094 (size: 0x1)
    bool EnableCustomFadeTime;                                                        // 0x0095 (size: 0x1)
    float FadeOutTime;                                                                // 0x0098 (size: 0x4)

}; // Size: 0xA0

struct FAdvancedAbility
{
    FName AbilityID;                                                                  // 0x0000 (size: 0x8)
    FName HiddenText;                                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAilmentDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString AilmentType;                                                              // 0x0010 (size: 0x10)
    FString Target;                                                                   // 0x0020 (size: 0x10)
    FString CalcType;                                                                 // 0x0030 (size: 0x10)
    FString Attribute;                                                                // 0x0040 (size: 0x10)
    int32 DiseaseRatio;                                                               // 0x0050 (size: 0x4)
    FString TargetDiseaseType;                                                        // 0x0058 (size: 0x10)
    FString TargetDiseaseName;                                                        // 0x0068 (size: 0x10)
    FString FieldDiseaseType;                                                         // 0x0078 (size: 0x10)
    FString OrderChangeType;                                                          // 0x0088 (size: 0x10)
    int32 AdvValue1;                                                                  // 0x0098 (size: 0x4)
    int32 AdvValue2;                                                                  // 0x009C (size: 0x4)
    int32 AdvValue3;                                                                  // 0x00A0 (size: 0x4)
    int32 AdvValue4;                                                                  // 0x00A4 (size: 0x4)

}; // Size: 0xA8

struct FAilmentHandler
{
    FName AilmentName;                                                                // 0x0000 (size: 0x8)
    int32 InvocationValue;                                                            // 0x0008 (size: 0x4)
    int32 InvocationTurn;                                                             // 0x000C (size: 0x4)
    int32 DiseaseRate;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FAreaInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName MiddleTownIconID;                                                           // 0x000C (size: 0x8)
    FName AreaNameID;                                                                 // 0x0014 (size: 0x8)
    FName AreaNameID_ForMissionRecord;                                                // 0x001C (size: 0x8)
    FName AreaEmblemID;                                                               // 0x0024 (size: 0x8)

}; // Size: 0x30

struct FAsyncLoad
{
}; // Size: 0x20

struct FBackPackItemData
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FBarMenuStoryItem
{
    int32 CharacterID;                                                                // 0x0000 (size: 0x4)
    TArray<EPlayableCharacterID> RelationCharaId;                                     // 0x0008 (size: 0x10)
    int32 Chapter;                                                                    // 0x0018 (size: 0x4)
    FText ChapterText;                                                                // 0x0020 (size: 0x18)
    FText SubTitleText;                                                               // 0x0038 (size: 0x18)
    FName DetailLabel;                                                                // 0x0050 (size: 0x8)
    bool IsEnable;                                                                    // 0x0058 (size: 0x1)
    EBARMENU_STORY_PROGRESSTYPE ProgressType;                                         // 0x0059 (size: 0x1)
    EBARMENU_STORY_SELECT_ITEM_TYPE ItemType;                                         // 0x005A (size: 0x1)
    FName StartEvent;                                                                 // 0x005C (size: 0x8)
    int32 RecommandationLV;                                                           // 0x0064 (size: 0x4)
    bool NewFlag;                                                                     // 0x0068 (size: 0x1)
    int32 MainStoryId;                                                                // 0x006C (size: 0x4)

}; // Size: 0x70

struct FBarTalkDefine : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<FName> ItemEventList;                                                      // 0x0010 (size: 0x10)
    TArray<FName> NormalEventList;                                                    // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FBattleAICommandData : public FTableRowBase
{
    FName m_strCommandname;                                                           // 0x0008 (size: 0x8)
    int32 m_nRate;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FBattleAdditiveOrderData
{
    EADDITIVE_ORDER_TYPE m_eOrderType;                                                // 0x0000 (size: 0x1)
    class ABattleCharacterBase* m_cOrderEnforcer;                                     // 0x0008 (size: 0x8)
    TArray<class ABattleCharacterBase*> m_acTarget;                                   // 0x0010 (size: 0x10)
    FName m_strExecAbilityName;                                                       // 0x0020 (size: 0x8)
    FName m_strExecAilmentName;                                                       // 0x0028 (size: 0x8)
    EATTRIBUTE_TYPE m_eAttributeType;                                                 // 0x0030 (size: 0x1)
    int32 m_nAddValue01;                                                              // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FBattleCameraInitData : public FTableRowBase
{
    FVector DefaultPosition;                                                          // 0x0008 (size: 0xC)
    FRotator DafaultRotate;                                                           // 0x0014 (size: 0xC)
    FVector StartPosition;                                                            // 0x0020 (size: 0xC)
    FRotator StartRotate;                                                             // 0x002C (size: 0xC)
    float FieldOfView;                                                                // 0x0038 (size: 0x4)
    float ManualFocusDistance;                                                        // 0x003C (size: 0x4)
    float CurrentFocalLength;                                                         // 0x0040 (size: 0x4)
    float CurrentAperture;                                                            // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FBattleEncountData : public FTableRowBase
{
    FName GroupID;                                                                    // 0x0008 (size: 0x8)
    int32 Appearance;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FBattleEncounterBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 FirstEncount;                                                               // 0x000C (size: 0x4)
    TArray<FBattleEncountData> group;                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBattlePlacementListBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FVector Placement;                                                                // 0x000C (size: 0xC)
    int32 Priority;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FBattlePlacementTypeBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EBATTLE_CAMERA_TYPE CameraType;                                                   // 0x000C (size: 0x1)
    TArray<FName> Placement;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBattleReplayData : public FTableRowBase
{
    bool Enable;                                                                      // 0x0008 (size: 0x1)
    TArray<int32> PlayerID;                                                           // 0x0010 (size: 0x10)
    TArray<int32> PlayerJob;                                                          // 0x0020 (size: 0x10)
    TArray<FVector> PlayerPos;                                                        // 0x0030 (size: 0x10)
    TArray<int32> PlayerDisease;                                                      // 0x0040 (size: 0x10)
    TArray<int32> PlayerStatus;                                                       // 0x0050 (size: 0x10)
    TArray<int32> PlayerWeapon;                                                       // 0x0060 (size: 0x10)
    int32 MasqueradeTargetID;                                                         // 0x0070 (size: 0x4)
    int32 MasqueradeJobID;                                                            // 0x0074 (size: 0x4)
    TArray<int32> EnemyID;                                                            // 0x0078 (size: 0x10)
    TArray<FVector> EnemyPos;                                                         // 0x0088 (size: 0x10)
    TArray<int32> EnemyDisease;                                                       // 0x0098 (size: 0x10)
    TArray<int32> EnemyDiseaseParam;                                                  // 0x00A8 (size: 0x10)
    TArray<int32> EnemyStatus;                                                        // 0x00B8 (size: 0x10)
    TArray<int32> EnemyActionMode;                                                    // 0x00C8 (size: 0x10)
    TArray<int32> SupportID;                                                          // 0x00D8 (size: 0x10)
    TArray<int32> SupportStatus;                                                      // 0x00E8 (size: 0x10)
    int32 ActionID;                                                                   // 0x00F8 (size: 0x4)
    int32 ActionEnforcer;                                                             // 0x00FC (size: 0x4)
    int32 PotentialityActionStatus;                                                   // 0x0100 (size: 0x4)
    int32 ActionTarget;                                                               // 0x0104 (size: 0x4)
    TArray<int32> ActionParam;                                                        // 0x0108 (size: 0x10)
    int32 FieldStatus;                                                                // 0x0118 (size: 0x4)
    int32 FinishType;                                                                 // 0x011C (size: 0x4)
    int32 CameraType;                                                                 // 0x0120 (size: 0x4)

}; // Size: 0x128

struct FBattleResultItemDropData : public FTableRowBase
{
    FName ItemId;                                                                     // 0x0008 (size: 0x8)
    int32 Num;                                                                        // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FBattleSupportCharaInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 HP;                                                                         // 0x000C (size: 0x4)
    int32 PhysicalAttack;                                                             // 0x0010 (size: 0x4)
    int32 MagicalPower;                                                               // 0x0014 (size: 0x4)
    int32 PhysicalDefense;                                                            // 0x0018 (size: 0x4)
    int32 MagicDefense;                                                               // 0x001C (size: 0x4)
    int32 HitRate;                                                                    // 0x0020 (size: 0x4)
    int32 EvasionRate;                                                                // 0x0024 (size: 0x4)
    int32 ActionSpeed;                                                                // 0x0028 (size: 0x4)
    int32 AttackActionRate;                                                           // 0x002C (size: 0x4)
    int32 ProtectActionRate;                                                          // 0x0030 (size: 0x4)
    int32 SuccessRate;                                                                // 0x0034 (size: 0x4)
    int32 RelationDecrease;                                                           // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FBattleVoiceDataList : public FTableRowBase
{
    EBATTLE_VOICE_TYPE m_eBattleVoiceType;                                            // 0x0008 (size: 0x1)
    TArray<FBattleVoiceSetData> m_acBattleVoiceData;                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBattleVoiceSetData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EBATTLE_VOICE_TYPE BattleVoiceType;                                               // 0x000C (size: 0x1)
    bool TargetSelf;                                                                  // 0x000D (size: 0x1)
    FName TargetID;                                                                   // 0x0010 (size: 0x8)
    FName InvadeID;                                                                   // 0x0018 (size: 0x8)
    FName SupporterID;                                                                // 0x0020 (size: 0x8)
    FName EnemyID;                                                                    // 0x0028 (size: 0x8)
    FName EnemyGroupID;                                                               // 0x0030 (size: 0x8)
    EDISEASE_CATEGORY DiseaseCategory;                                                // 0x0038 (size: 0x1)
    FName AbilityID;                                                                  // 0x003C (size: 0x8)
    FName EventFlag;                                                                  // 0x0044 (size: 0x8)
    bool BossFlag;                                                                    // 0x004C (size: 0x1)
    bool FieldCommandFlag;                                                            // 0x004D (size: 0x1)
    bool PinchFlag;                                                                   // 0x004E (size: 0x1)
    bool JustBreakFlag;                                                               // 0x004F (size: 0x1)
    bool CounterFlag;                                                                 // 0x0050 (size: 0x1)
    bool SongFlag;                                                                    // 0x0051 (size: 0x1)
    bool DanceFlag;                                                                   // 0x0052 (size: 0x1)
    bool MeatFlag;                                                                    // 0x0053 (size: 0x1)
    int32 Border;                                                                     // 0x0054 (size: 0x4)
    bool PlayOnce;                                                                    // 0x0058 (size: 0x1)
    int32 VoiceRate;                                                                  // 0x005C (size: 0x4)
    int32 Priority;                                                                   // 0x0060 (size: 0x4)
    FName VoiceLabel;                                                                 // 0x0064 (size: 0x8)

}; // Size: 0x70

struct FBattleVoiceSetList : public FTableRowBase
{
    FName m_strCharacterID;                                                           // 0x0008 (size: 0x8)
    TArray<FName> m_astrBattleVoiceLabel;                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBgmInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString Label;                                                                    // 0x0010 (size: 0x10)
    FName CueSheetName;                                                               // 0x0020 (size: 0x8)
    TSoftObjectPtr<USoundAtomCue> Asset;                                              // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FBitFlagDefine : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FButtonTextData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString BaseText;                                                                 // 0x0010 (size: 0x10)
    FString ItalianText;                                                              // 0x0020 (size: 0x10)
    FString FrenchText;                                                               // 0x0030 (size: 0x10)
    FString SpanishText;                                                              // 0x0040 (size: 0x10)
    FString GermanText;                                                               // 0x0050 (size: 0x10)
    FString UKText;                                                                   // 0x0060 (size: 0x10)
    FString USText;                                                                   // 0x0070 (size: 0x10)
    FString DvorokText;                                                               // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FCameraLockParams
{
    bool bLock;                                                                       // 0x0000 (size: 0x1)
    bool bLockEnableX;                                                                // 0x0001 (size: 0x1)
    bool bLockEnableY;                                                                // 0x0002 (size: 0x1)
    bool bLockEnableZ;                                                                // 0x0003 (size: 0x1)
    FVector LockOffset;                                                               // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FCharResource_BattleReductionTable : public FTableRowBase
{
    TArray<FString> m_strBattleTextureNameList;                                       // 0x0008 (size: 0x10)
    TArray<FString> m_strBattleMaterialNameList;                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCharacterActionResource : public FTableRowBase
{
    TArray<TSoftObjectPtr<UPaperFlipbook>> FrActionList;                              // 0x0008 (size: 0x10)
    TArray<TSoftObjectPtr<UPaperFlipbook>> ReActionList;                              // 0x0018 (size: 0x10)
    TArray<TSoftObjectPtr<UPaperFlipbook>> LeActionList;                              // 0x0028 (size: 0x10)
    TArray<TSoftObjectPtr<UPaperFlipbook>> RiActionList;                              // 0x0038 (size: 0x10)
    TArray<bool> Loop;                                                                // 0x0048 (size: 0x10)
    float Height;                                                                     // 0x0058 (size: 0x4)
    bool TemplateSocket;                                                              // 0x005C (size: 0x1)
    FName WalkFootstep;                                                               // 0x0060 (size: 0x8)
    float SpeedWalk;                                                                  // 0x0068 (size: 0x4)
    float SpeedRun;                                                                   // 0x006C (size: 0x4)
    TArray<FName> ActionFootStep;                                                     // 0x0070 (size: 0x10)
    TArray<float> ActionFootStepInterval;                                             // 0x0080 (size: 0x10)
    float LargeIconOffsetX;                                                           // 0x0090 (size: 0x4)
    float LargeIconOffsetY;                                                           // 0x0094 (size: 0x4)
    float LargeIconInvertOffsetX;                                                     // 0x0098 (size: 0x4)
    float SmallIconOffsetX;                                                           // 0x009C (size: 0x4)
    float SmallIconOffsetY;                                                           // 0x00A0 (size: 0x4)
    float SmallIconInvertOffsetX;                                                     // 0x00A4 (size: 0x4)
    float TabIconOffsetX;                                                             // 0x00A8 (size: 0x4)
    float TabIconOffsetY;                                                             // 0x00AC (size: 0x4)
    float InvadeListOffsetX;                                                          // 0x00B0 (size: 0x4)
    float InvadeListOffsetY;                                                          // 0x00B4 (size: 0x4)
    float InvadeListScale;                                                            // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FCharacterCostumeInfo
{
    int32 EventFlag;                                                                  // 0x0000 (size: 0x4)
    FName ResourceLabel;                                                              // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FCharacterFormData
{
    float BalloonOffsetX;                                                             // 0x0000 (size: 0x4)
    float BalloonOffsetY;                                                             // 0x0004 (size: 0x4)
    float CollisionOffsetX;                                                           // 0x0008 (size: 0x4)
    float CollisionOffsetY;                                                           // 0x000C (size: 0x4)
    float CollisionOffsetZ;                                                           // 0x0010 (size: 0x4)
    float CollisionExtentX;                                                           // 0x0014 (size: 0x4)
    float CollisionExtentY;                                                           // 0x0018 (size: 0x4)
    float CollisionExtentZ;                                                           // 0x001C (size: 0x4)

}; // Size: 0x20

struct FCharacterFormDataSet : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName CharaResourceLabel;                                                         // 0x000C (size: 0x8)
    EKSCharacterAction CharaActionLabel;                                              // 0x0014 (size: 0x1)
    TArray<FCharacterFormData> FormData;                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCharacterGridPanelParam
{
    EPlayableCharacterID PlayerID;                                                    // 0x0000 (size: 0x1)
    bool IsGrayOut;                                                                   // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FCharacterGrowData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 NextExp;                                                                    // 0x000C (size: 0x4)
    int32 TotalExp;                                                                   // 0x0010 (size: 0x4)
    FCharacterParam Parameter;                                                        // 0x0014 (size: 0x34)
    FFieldCommandParam FCParameter;                                                   // 0x0048 (size: 0x28)

}; // Size: 0x70

struct FCharacterParam
{
    int32 HP;                                                                         // 0x0000 (size: 0x4)
    int32 MP;                                                                         // 0x0004 (size: 0x4)
    int32 BP;                                                                         // 0x0008 (size: 0x4)
    int32 SP;                                                                         // 0x000C (size: 0x4)
    int32 POT;                                                                        // 0x0010 (size: 0x4)
    int32 ATK;                                                                        // 0x0014 (size: 0x4)
    int32 DEF;                                                                        // 0x0018 (size: 0x4)
    int32 MATK;                                                                       // 0x001C (size: 0x4)
    int32 MDEF;                                                                       // 0x0020 (size: 0x4)
    int32 ACC;                                                                        // 0x0024 (size: 0x4)
    int32 EVA;                                                                        // 0x0028 (size: 0x4)
    int32 CON;                                                                        // 0x002C (size: 0x4)
    int32 AGI;                                                                        // 0x0030 (size: 0x4)

}; // Size: 0x34

struct FCharacterParamBeforeAfterData
{
    FText ParamText;                                                                  // 0x0000 (size: 0x18)
    int32 BeforeParam;                                                                // 0x0018 (size: 0x4)
    int32 AfterParam;                                                                 // 0x001C (size: 0x4)

}; // Size: 0x20

struct FCharacterResourceData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ActionLabel;                                                                // 0x000C (size: 0x8)
    TSoftObjectPtr<UTexture2D> ActionOrderIconL;                                      // 0x0018 (size: 0x28)
    TSoftObjectPtr<UTexture2D> ActionOrderIconS;                                      // 0x0040 (size: 0x28)
    TSoftObjectPtr<UTexture2D> FieldCommandIcon;                                      // 0x0068 (size: 0x28)
    FName BattleStartVoiceID;                                                         // 0x0090 (size: 0x8)
    FName BattleVoiceCharacterID;                                                     // 0x0098 (size: 0x8)
    int32 WaitEnemyActionFrame;                                                       // 0x00A0 (size: 0x4)
    TArray<FActionDelaySEData> ActionDelaySEData;                                     // 0x00A8 (size: 0x10)
    ESESSION_SE_TYPE BattleSessionSEID;                                               // 0x00B8 (size: 0x1)
    FVector BattleCursorOffset;                                                       // 0x00BC (size: 0xC)

}; // Size: 0xC8

struct FCommonControllerConfigData : public FTableRowBase
{
    TArray<FName> KeyList;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCommonNotificationParam
{
    FText MessageText;                                                                // 0x0000 (size: 0x18)
    FName MessageTextLabel;                                                           // 0x0018 (size: 0x8)
    FString MessageTextLabel_Param0;                                                  // 0x0020 (size: 0x10)
    ECommonNotificationType CommonNotificationType;                                   // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FCustomMissionFlipbookJobData
{
    TArray<FName> LabelList;                                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCustomMissionFlipbookList : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TMap<int32, FName> PlayerSelectList;                                              // 0x0010 (size: 0x50)
    TMap<int32, FCustomMissionFlipbookJobData> PlayerJobList;                         // 0x0060 (size: 0x50)
    TMap<int32, FCustomMissionFlipbookJobData> PlayerJobList_01;                      // 0x00B0 (size: 0x50)
    TMap<int32, FName> PlayerCostumeList;                                             // 0x0100 (size: 0x50)

}; // Size: 0x150

struct FDarkAreaData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 ActiveFlag;                                                                 // 0x000C (size: 0x4)
    EHOLY_TORCH_TYPE HolyTorchType;                                                   // 0x0010 (size: 0x1)
    FName TorchLevel;                                                                 // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FDataTableTutorialList : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ListName;                                                                   // 0x000C (size: 0x8)
    TArray<FName> FlagPartLabel;                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDataTableTutorialPageData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 TemplateType;                                                               // 0x000C (size: 0x4)
    TArray<FName> PageImage;                                                          // 0x0010 (size: 0x10)
    FName TitleText;                                                                  // 0x0020 (size: 0x8)
    TArray<FName> PageText;                                                           // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FDatabaseInfo : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EDB_LOAD_TIMING LoadTiming;                                                       // 0x000C (size: 0x1)
    FSoftObjectPath DataTable;                                                        // 0x0010 (size: 0x18)
    FString DBClassPath;                                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FDebugBattleLog : public FTableRowBase
{
    int32 m_nIndex;                                                                   // 0x0008 (size: 0x4)
    EDEBUG_BATTLE_LOG_CATEGORY m_eCategory;                                           // 0x000C (size: 0x1)
    FText m_strTitle;                                                                 // 0x0010 (size: 0x18)
    FText m_strIssuer;                                                                // 0x0028 (size: 0x18)
    FText m_strComment;                                                               // 0x0040 (size: 0x18)
    FText m_strDetail;                                                                // 0x0058 (size: 0x18)
    FText m_astrTagList;                                                              // 0x0070 (size: 0x18)

}; // Size: 0x88

struct FDebugListMenuFilter
{
}; // Size: 0x28

struct FDebugListMenuItem
{
}; // Size: 0x40

struct FDebugParam
{
    FString DebugName;                                                                // 0x0000 (size: 0x10)
    EDEBUG_EDIT_TYPE EditType;                                                        // 0x0010 (size: 0x1)
    TArray<FText> ListLabel;                                                          // 0x0018 (size: 0x10)
    FString DebugInformation;                                                         // 0x0028 (size: 0x10)
    EDEBUG_INFORMATION_COLOR_TYPE InformationColorType;                               // 0x0038 (size: 0x1)
    bool DefaultToggle;                                                               // 0x0039 (size: 0x1)
    int32 DefaultIndex;                                                               // 0x003C (size: 0x4)
    int32 nDefaultValue;                                                              // 0x0040 (size: 0x4)
    int32 nDefaultMin;                                                                // 0x0044 (size: 0x4)
    int32 nDefaultMax;                                                                // 0x0048 (size: 0x4)
    int32 nDigit;                                                                     // 0x004C (size: 0x4)
    float fDefaultValue;                                                              // 0x0050 (size: 0x4)
    float fDefaultMin;                                                                // 0x0054 (size: 0x4)
    float fDefaultMax;                                                                // 0x0058 (size: 0x4)
    float fDigit;                                                                     // 0x005C (size: 0x4)
    int32 nItemCounter;                                                               // 0x0070 (size: 0x4)
    int32 nHierarchy;                                                                 // 0x0074 (size: 0x4)
    int32 nParentHierarchy;                                                           // 0x0078 (size: 0x4)
    int32 nChildHierarchy;                                                            // 0x007C (size: 0x4)

}; // Size: 0x130

struct FDebugPrimitiveData
{
    EDebugCanvasPrimType PrimitiveType;                                               // 0x0000 (size: 0x1)
    TArray<FVector2D> Position;                                                       // 0x0008 (size: 0x10)
    FLinearColor Color;                                                               // 0x0018 (size: 0x10)
    float LineThickness;                                                              // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDebugTextData
{
    FText Text;                                                                       // 0x0000 (size: 0x18)
    FVector2D Position;                                                               // 0x0018 (size: 0x8)
    FLinearColor Color;                                                               // 0x0020 (size: 0x10)
    int32 FontSize;                                                                   // 0x0030 (size: 0x4)

}; // Size: 0x50

struct FDestinationData
{
    ELevelTriggerID TriggerID;                                                        // 0x0000 (size: 0x1)
    TArray<int32> HideIconFlag;                                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDiseaseDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName DisplayName;                                                                // 0x000C (size: 0x8)
    FName Detail;                                                                     // 0x0014 (size: 0x8)
    int32 DisplayOrder;                                                               // 0x001C (size: 0x4)
    FString DiseaseType;                                                              // 0x0020 (size: 0x10)
    bool EnableResist;                                                                // 0x0030 (size: 0x1)
    FString ResistType;                                                               // 0x0038 (size: 0x10)
    bool EnableTurnCount;                                                             // 0x0048 (size: 0x1)
    FString DiseaseCategory;                                                          // 0x0050 (size: 0x10)
    FString StealthType;                                                              // 0x0060 (size: 0x10)
    bool BattleEndContinue;                                                           // 0x0070 (size: 0x1)
    bool EnableBuffExtension;                                                         // 0x0071 (size: 0x1)
    bool EnableDebuffExtension;                                                       // 0x0072 (size: 0x1)
    bool EnableDeconditionExtension;                                                  // 0x0073 (size: 0x1)
    bool EnableChangePermanent;                                                       // 0x0074 (size: 0x1)
    bool EnableDiseaseCopy;                                                           // 0x0075 (size: 0x1)
    int32 AdvValue1;                                                                  // 0x0078 (size: 0x4)
    int32 AdvValue2;                                                                  // 0x007C (size: 0x4)
    int32 AdvValue3;                                                                  // 0x0080 (size: 0x4)
    int32 AdvValue4;                                                                  // 0x0084 (size: 0x4)
    FString AdvLabel1;                                                                // 0x0088 (size: 0x10)
    FString ResorceLabel;                                                             // 0x0098 (size: 0x10)
    FString EffectLabel;                                                              // 0x00A8 (size: 0x10)
    bool AttachEffect;                                                                // 0x00B8 (size: 0x1)
    bool GroundEffect;                                                                // 0x00B9 (size: 0x1)
    FString AttachSocketName;                                                         // 0x00C0 (size: 0x10)

}; // Size: 0xD0

struct FDiseaseListItemData
{
    FName IconLabel;                                                                  // 0x0000 (size: 0x8)
    FName DetailTextLabel;                                                            // 0x0008 (size: 0x8)
    EDISEASE_CATEGORY DiseaseCategory;                                                // 0x0010 (size: 0x1)
    int32 DisplayOrder;                                                               // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FDismantlingDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<FAilmentHandler> Ailment;                                                  // 0x0010 (size: 0x10)
    EDISMANTLING_EFFECT_TYPE EFFECT;                                                  // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FEffectComponentList
{
    TArray<class UParticleSystemComponent*> EffectList;                               // 0x0000 (size: 0x10)
    int32 MaxNum;                                                                     // 0x0010 (size: 0x4)
    bool LoopEffect;                                                                  // 0x0014 (size: 0x1)
    FVector EffectOffset;                                                             // 0x0018 (size: 0xC)

}; // Size: 0x28

struct FEffectData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TSoftObjectPtr<UParticleSystem> EffectAsset;                                      // 0x0010 (size: 0x28)
    int32 SpawnMax;                                                                   // 0x0038 (size: 0x4)
    bool LoopEffect;                                                                  // 0x003C (size: 0x1)
    bool Stationary;                                                                  // 0x003D (size: 0x1)
    FVector EffectOffset;                                                             // 0x0040 (size: 0xC)

}; // Size: 0x50

struct FEncountData : public FTableRowBase
{
    int32 ProgressBorder;                                                             // 0x0008 (size: 0x4)
    int32 DisplayLevel;                                                               // 0x000C (size: 0x4)
    int32 DangerLevel;                                                                // 0x0010 (size: 0x4)
    FName EncounterName;                                                              // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FEncountFlagData
{
    FName EncountTriggerLabel;                                                        // 0x0000 (size: 0x8)
    int32 EventFlag;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FEncountFlagStartEndData
{
    FName EncountTriggerLabel;                                                        // 0x0000 (size: 0x8)
    TArray<int32> StartFlag;                                                          // 0x0008 (size: 0x10)
    TArray<int32> EndFlag;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FEncountTriggerData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 StartFlag;                                                                  // 0x000C (size: 0x4)
    int32 StartFlag_2;                                                                // 0x0010 (size: 0x4)
    int32 StartFlag_3;                                                                // 0x0014 (size: 0x4)
    int32 EndFlag;                                                                    // 0x0018 (size: 0x4)
    int32 EndFlag_2;                                                                  // 0x001C (size: 0x4)
    int32 EndFlag_3;                                                                  // 0x0020 (size: 0x4)
    float DayTimeDecreaseValue;                                                       // 0x0024 (size: 0x4)
    FName DayTimeEncountVolumeName;                                                   // 0x0028 (size: 0x8)
    float NightDecreaseValue;                                                         // 0x0030 (size: 0x4)
    FName NightEncountVolumeName;                                                     // 0x0034 (size: 0x8)
    float LostWayDecreaseValue;                                                       // 0x003C (size: 0x4)
    FName LostWayEncountVolumeName;                                                   // 0x0040 (size: 0x8)
    float DarkAreaDecreaseValue;                                                      // 0x0048 (size: 0x4)
    FName DarkAreaEncountVolumeName;                                                  // 0x004C (size: 0x8)

}; // Size: 0x58

struct FEncountVolume : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 StartFlag;                                                                  // 0x000C (size: 0x4)
    int32 EndFlag;                                                                    // 0x0010 (size: 0x4)
    int32 UseMapIndex;                                                                // 0x0014 (size: 0x4)
    int32 EncountStepMin;                                                             // 0x0018 (size: 0x4)
    int32 RandomStepA;                                                                // 0x001C (size: 0x4)
    int32 RandomStepB;                                                                // 0x0020 (size: 0x4)
    bool WaterSide;                                                                   // 0x0024 (size: 0x1)
    EAreaID Area;                                                                     // 0x0025 (size: 0x1)
    FRareEnemyParam RareCatlinParam;                                                  // 0x0028 (size: 0x14)
    FRareEnemyParam RareOctlinParam;                                                  // 0x003C (size: 0x14)
    TArray<FEncountData> EncounterList;                                               // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FEndRollSegmentData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName EventImageLabelPartnerA;                                                    // 0x000C (size: 0x8)
    FName EventImageLabelPartnerB;                                                    // 0x0014 (size: 0x8)
    bool BattleRevivalFlag;                                                           // 0x001C (size: 0x1)
    FName BattleEnemyGroupA;                                                          // 0x0020 (size: 0x8)
    FName BattleEnemyGroupB;                                                          // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FEnemyDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString EnemyID;                                                                  // 0x0010 (size: 0x10)
    FString DisplayNameID;                                                            // 0x0020 (size: 0x10)
    FString ResourceLabel;                                                            // 0x0030 (size: 0x10)
    int32 DisplayRank;                                                                // 0x0040 (size: 0x4)
    int32 EnemyLevel;                                                                 // 0x0044 (size: 0x4)
    float DamageRatio;                                                                // 0x0048 (size: 0x4)
    FString Size;                                                                     // 0x0050 (size: 0x10)
    bool NPCFlag;                                                                     // 0x0060 (size: 0x1)
    FString WeaponStance;                                                             // 0x0068 (size: 0x10)
    FString WeaponItemLabel;                                                          // 0x0078 (size: 0x10)
    bool DeadEffectSlow;                                                              // 0x0088 (size: 0x1)
    bool MainEnemy;                                                                   // 0x0089 (size: 0x1)
    bool NonPartBattle;                                                               // 0x008A (size: 0x1)
    bool UseCatDamageType;                                                            // 0x008B (size: 0x1)
    bool DisableDeadKnockBack;                                                        // 0x008C (size: 0x1)
    bool DisableBreakSlow;                                                            // 0x008D (size: 0x1)
    bool LegendTameMonster;                                                           // 0x008E (size: 0x1)
    int32 Exp;                                                                        // 0x0090 (size: 0x4)
    int32 JobPoint;                                                                   // 0x0094 (size: 0x4)
    int32 Money;                                                                      // 0x0098 (size: 0x4)
    bool StealMoneyGuard;                                                             // 0x009C (size: 0x1)
    int32 StealMoney;                                                                 // 0x00A0 (size: 0x4)
    FString HaveItemID;                                                               // 0x00A8 (size: 0x10)
    int32 DropProbability;                                                            // 0x00B8 (size: 0x4)
    bool StealGuard;                                                                  // 0x00BC (size: 0x1)
    FString StealItemID;                                                              // 0x00C0 (size: 0x10)
    bool TameEnable;                                                                  // 0x00D0 (size: 0x1)
    float DefaultTameRate;                                                            // 0x00D4 (size: 0x4)
    FString InvadeMonsterID;                                                          // 0x00D8 (size: 0x10)
    int32 FirstBP;                                                                    // 0x00E8 (size: 0x4)
    FString DeadType;                                                                 // 0x00F0 (size: 0x10)
    bool BribeGuard;                                                                  // 0x0100 (size: 0x1)
    int32 BribeMoney;                                                                 // 0x0104 (size: 0x4)
    float AbilitySEDelay;                                                             // 0x0108 (size: 0x4)
    int32 RevealShieldPoint;                                                          // 0x010C (size: 0x4)
    FString TextInfoLabel;                                                            // 0x0110 (size: 0x10)
    FString DismantlingLabel;                                                         // 0x0120 (size: 0x10)
    int32 WaitEnemyActionFrame;                                                       // 0x0130 (size: 0x4)

}; // Size: 0x138

struct FEnemyGroupBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    bool BattleStartEnemyVoiceEnable;                                                 // 0x000C (size: 0x1)
    FName VoiceID;                                                                    // 0x0010 (size: 0x8)
    FName TalkPlayerID;                                                               // 0x0018 (size: 0x8)
    FName PlayerVoiceID;                                                              // 0x0020 (size: 0x8)
    FName BattleStartEvent;                                                           // 0x0028 (size: 0x8)
    bool BattleStartDashEnable;                                                       // 0x0030 (size: 0x1)
    FName BGMID;                                                                      // 0x0034 (size: 0x8)
    bool UseBattleBGM;                                                                // 0x003C (size: 0x1)
    bool UseVictoryBGM;                                                               // 0x003D (size: 0x1)
    bool ResumeBGM;                                                                   // 0x003E (size: 0x1)
    bool ViewResult;                                                                  // 0x003F (size: 0x1)
    bool UseVictoryAction;                                                            // 0x0040 (size: 0x1)
    bool ResultDashEnable;                                                            // 0x0041 (size: 0x1)
    bool BoostFinishResultEnable;                                                     // 0x0042 (size: 0x1)
    bool BossBattle;                                                                  // 0x0043 (size: 0x1)
    bool EscapeEnable;                                                                // 0x0044 (size: 0x1)
    bool ItemEnable;                                                                  // 0x0045 (size: 0x1)
    bool GuardEnable;                                                                 // 0x0046 (size: 0x1)
    bool BoostEnable;                                                                 // 0x0047 (size: 0x1)
    FName PlacementType;                                                              // 0x0048 (size: 0x8)
    TArray<FName> EnemyID;                                                            // 0x0050 (size: 0x10)
    FString SaveEndrollSegment;                                                       // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FEnvSoundFadeData
{
    float FadeOutStartVolume;                                                         // 0x0000 (size: 0x4)
    float FadeOutTime;                                                                // 0x0004 (size: 0x4)
    float FadeInTime;                                                                 // 0x0008 (size: 0x4)
    float FadeInVolume;                                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FEquipLanternData
{
    TArray<FLanternCheckData> EquipLanternDayTime;                                    // 0x0000 (size: 0x10)
    TArray<FLanternCheckData> EquipLanternNight;                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FEquipParamBeforeAfter : public FTableRowBase
{
    TArray<int32> CharacterParam;                                                     // 0x0008 (size: 0x10)
    TArray<int32> EquipAllBefore;                                                     // 0x0018 (size: 0x10)
    TArray<int32> EquipTargetBefore;                                                  // 0x0028 (size: 0x10)
    TArray<int32> EquipTargetAfter;                                                   // 0x0038 (size: 0x10)
    TArray<int32> ParamAllBefore;                                                     // 0x0048 (size: 0x10)
    TArray<int32> ParamAllAfter;                                                      // 0x0058 (size: 0x10)
    TArray<bool> IsEffective;                                                         // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FEquipmentCategoryBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName DisplayNameID;                                                              // 0x000C (size: 0x8)
    class UTexture2D* IconTexture;                                                    // 0x0018 (size: 0x8)
    FName IconLabel;                                                                  // 0x0020 (size: 0x8)
    bool TwoHanded;                                                                   // 0x0028 (size: 0x1)
    bool CounterEnable;                                                               // 0x0029 (size: 0x1)
    TArray<FName> EffectiveRace;                                                      // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FEquipmentRecommendedCalcData
{
    int32 CharaID;                                                                    // 0x0000 (size: 0x4)
    FName ItemLabel;                                                                  // 0x0004 (size: 0x8)
    float EvalautionValue;                                                            // 0x000C (size: 0x4)
    bool SkipFlag;                                                                    // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FEquipmentRecommendedData
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    int32 HP;                                                                         // 0x0008 (size: 0x4)
    int32 MP;                                                                         // 0x000C (size: 0x4)
    int32 PAtk;                                                                       // 0x0010 (size: 0x4)
    int32 PDef;                                                                       // 0x0014 (size: 0x4)
    int32 MATK;                                                                       // 0x0018 (size: 0x4)
    int32 MDEF;                                                                       // 0x001C (size: 0x4)
    int32 ACC;                                                                        // 0x0020 (size: 0x4)
    int32 EVA;                                                                        // 0x0024 (size: 0x4)
    int32 CON;                                                                        // 0x0028 (size: 0x4)
    int32 AGI;                                                                        // 0x002C (size: 0x4)
    int32 Count;                                                                      // 0x0030 (size: 0x4)

}; // Size: 0x34

struct FEquipmentTextureData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<FEquipmentTextureInfo> WeaponStanceTextures;                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FEquipmentTextureInfo
{
    FName PCResourceLabel;                                                            // 0x0000 (size: 0x8)
    FName NPCResourceLabel;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FEquippedItemData : public FTableRowBase
{
    int32 EquippedCount;                                                              // 0x0008 (size: 0x4)
    int32 EquipCHaracterIdMask;                                                       // 0x000C (size: 0x4)

}; // Size: 0x10

struct FEventAtomSoundData
{
    class USoundAtomCue* uAtomCue;                                                    // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FEventCheckData : public FTableRowBase
{
    int32 Index;                                                                      // 0x0008 (size: 0x4)
    int32 CheckCount;                                                                 // 0x000C (size: 0x4)
    int32 LogicalType;                                                                // 0x0010 (size: 0x4)
    TArray<int32> FlagList;                                                           // 0x0018 (size: 0x10)
    TArray<bool> FlagEnableList;                                                      // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FEventCommandData
{
}; // Size: 0xC

struct FEventData : public FTableRowBase
{
    int32 Command;                                                                    // 0x0008 (size: 0x4)
    int32 Target;                                                                     // 0x000C (size: 0x4)
    FVector Pos;                                                                      // 0x0010 (size: 0xC)
    int32 Dir;                                                                        // 0x001C (size: 0x4)
    FString Text;                                                                     // 0x0020 (size: 0x10)
    bool Async;                                                                       // 0x0030 (size: 0x1)
    TArray<FString> OptAry;                                                           // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FEventEffect
{
    bool Loop;                                                                        // 0x0000 (size: 0x1)
    TWeakObjectPtr<class UParticleSystemComponent> EffectData;                        // 0x0004 (size: 0x8)
    float LifeTime;                                                                   // 0x000C (size: 0x4)
    FVector Position;                                                                 // 0x0010 (size: 0xC)
    TWeakObjectPtr<class AActor> Target;                                              // 0x001C (size: 0x8)

}; // Size: 0x24

struct FEventEmotion
{
    bool Loop;                                                                        // 0x0000 (size: 0x1)
    float LifeTime;                                                                   // 0x0004 (size: 0x4)
    TWeakObjectPtr<class AKSCharacterBase> Target;                                    // 0x0008 (size: 0x8)
    FName TargetTag;                                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FEventFlagData
{
    int32 EventFlag;                                                                  // 0x0000 (size: 0x4)
    bool FlagStatus;                                                                  // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FEventListData : public FTableRowBase
{
    int32 EventIndex;                                                                 // 0x0008 (size: 0x4)
    FName ExecCode;                                                                   // 0x000C (size: 0x8)
    FName CueSheetName;                                                               // 0x0014 (size: 0x8)
    FName RadarMapExitCode;                                                           // 0x001C (size: 0x8)
    FName MapID;                                                                      // 0x0024 (size: 0x8)
    EEventKind Kind;                                                                  // 0x002C (size: 0x1)
    FName EventSoundLabel;                                                            // 0x0030 (size: 0x8)
    FName MissionLabel;                                                               // 0x0038 (size: 0x8)
    int32 EventSkip;                                                                  // 0x0040 (size: 0x4)
    ELevelTriggerID LevelTriggerID;                                                   // 0x0044 (size: 0x1)
    int32 LanthanumFlag;                                                              // 0x0048 (size: 0x4)
    FName EncountTrigger;                                                             // 0x004C (size: 0x8)
    FName CameraLockTrigger1;                                                         // 0x0054 (size: 0x8)
    FName CameraLockTrigger2;                                                         // 0x005C (size: 0x8)
    FName CameraLockTrigger3;                                                         // 0x0064 (size: 0x8)
    int32 StartFadeOutFlag;                                                           // 0x006C (size: 0x4)
    FName ChengeTimeSequencer;                                                        // 0x0070 (size: 0x8)
    FName ChengeFinishTimeSequencer;                                                  // 0x0078 (size: 0x8)
    int32 TargetChara;                                                                // 0x0080 (size: 0x4)
    bool EncountReset;                                                                // 0x0084 (size: 0x1)
    TArray<FString> Args;                                                             // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FEventPlayData
{
    class AKSCharacterBase* TargetCharacter;                                          // 0x0000 (size: 0x8)
    bool TheaterMode;                                                                 // 0x0010 (size: 0x1)
    FName OverrideMapID;                                                              // 0x0014 (size: 0x8)
    bool ForcePlayEvent;                                                              // 0x001C (size: 0x1)
    bool PartyChat;                                                                   // 0x001D (size: 0x1)

}; // Size: 0x20

struct FEventSaveData
{
    TArray<int32> EventCheckCount;                                                    // 0x0000 (size: 0x10)
    TArray<bool> EventFlag;                                                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FEventSoundData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 BgmPlayTypeOnStart;                                                         // 0x000C (size: 0x4)
    FName BgmLabelOnStart;                                                            // 0x0010 (size: 0x8)
    int32 BgmPlayTypeOnEnd;                                                           // 0x0018 (size: 0x4)
    FName BgmLabelOnEnd;                                                              // 0x001C (size: 0x8)
    FName FixedFieldBgmLabel;                                                         // 0x0024 (size: 0x8)
    TArray<FName> FixedFieldBgmLevels;                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FFShopInfoDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ShopName;                                                                   // 0x000C (size: 0x8)
    FString ShopType;                                                                 // 0x0018 (size: 0x10)
    FName ShopBGM;                                                                    // 0x0028 (size: 0x8)
    int32 InnBasePrice;                                                               // 0x0030 (size: 0x4)
    FName InnDiscountItem;                                                            // 0x0034 (size: 0x8)
    int32 InnDiscountBasePrice;                                                       // 0x003C (size: 0x4)

}; // Size: 0x40

struct FFadeDataBase : public FTableRowBase
{
    EEVENT_FADE_TYPE EventFadeType;                                                   // 0x0008 (size: 0x1)
    float FadeTime;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FFastTravelChangeDestination : public FTableRowBase
{
    FName From;                                                                       // 0x0008 (size: 0x8)
    FName To;                                                                         // 0x0010 (size: 0x8)
    int32 BeginEventFlag;                                                             // 0x0018 (size: 0x4)
    int32 EndEventFlag;                                                               // 0x001C (size: 0x4)

}; // Size: 0x20

struct FFieldCommandAssistItem
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    float BenefitValue;                                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFieldCommandData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    MJFieldCommandType FieldCommandType;                                              // 0x000C (size: 0x1)
    EFieldCommandCategory FieldCommandCategory;                                       // 0x000D (size: 0x1)
    FName NameTextLabel;                                                              // 0x0010 (size: 0x8)
    FName DetailTextLabel;                                                            // 0x0018 (size: 0x8)
    FName DetailTextLabel_PlayerSelect;                                               // 0x0020 (size: 0x8)
    FName HelpTextLabel;                                                              // 0x0028 (size: 0x8)
    FName HelpTextLabel_NoNpc;                                                        // 0x0030 (size: 0x8)
    FName HelpTextLabel_Special;                                                      // 0x0038 (size: 0x8)
    FName HeaderTextLabel;                                                            // 0x0040 (size: 0x8)
    FName HeaderTextLabel_Special;                                                    // 0x0048 (size: 0x8)
    FName FooterTextLabel;                                                            // 0x0050 (size: 0x8)
    FName UnavailableTextLabel;                                                       // 0x0058 (size: 0x8)
    FName SELabel;                                                                    // 0x0060 (size: 0x8)
    FName IconLabel;                                                                  // 0x0068 (size: 0x8)
    FName IconLabel_Large;                                                            // 0x0070 (size: 0x8)
    FName StatusMenuIconLabel;                                                        // 0x0078 (size: 0x8)
    float ActionWaitTime;                                                             // 0x0080 (size: 0x4)
    TArray<float> BranchEventWeight;                                                  // 0x0088 (size: 0x10)
    TArray<FName> BeforeEventLabel;                                                   // 0x0098 (size: 0x10)
    TArray<FName> SuccessEventLabel;                                                  // 0x00A8 (size: 0x10)
    TArray<FName> FailedEventLabel;                                                   // 0x00B8 (size: 0x10)
    TArray<FName> BadConnectionEventLabel;                                            // 0x00C8 (size: 0x10)
    TSoftClassPtr<AFieldCommandFlowBase> FlowClass;                                   // 0x00D8 (size: 0x28)
    TSoftClassPtr<AFieldCommandFlowBase> FlowClassV2;                                 // 0x0100 (size: 0x28)
    TSoftClassPtr<AFieldCommandFlowBase> SubFlowClassV2;                              // 0x0128 (size: 0x28)

}; // Size: 0x150

struct FFieldCommandInfo : public FTableRowBase
{
    MJFieldCommandType DayTimeFC;                                                     // 0x0008 (size: 0x1)
    int32 DayTimeFCImpossibleFlag;                                                    // 0x000C (size: 0x4)
    MJFieldCommandType NightFC;                                                       // 0x0010 (size: 0x1)
    int32 NightFCImpossibleFlag;                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FFieldCommandParam : public FTableRowBase
{
    float RefundSuccess;                                                              // 0x0008 (size: 0x4)
    float RefundRate;                                                                 // 0x000C (size: 0x4)
    float TameRate;                                                                   // 0x0010 (size: 0x4)
    int32 TameCount;                                                                  // 0x0014 (size: 0x4)
    int32 TameMonsterRank;                                                            // 0x0018 (size: 0x4)
    float TameMonsterParamRatio;                                                      // 0x001C (size: 0x4)
    float LureRate;                                                                   // 0x0020 (size: 0x4)
    float SearchRate;                                                                 // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FFieldCommandResult
{
    MJFieldCommandType Type;                                                          // 0x0000 (size: 0x1)
    FieldCommandStatus Status;                                                        // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FFieldPathInfoData : public FTableRowBase
{
    int32 nID;                                                                        // 0x0008 (size: 0x4)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    EPATH_TYPE UniqueId;                                                              // 0x0020 (size: 0x1)
    int32 StartIndex;                                                                 // 0x0024 (size: 0x4)
    int32 FinishIndex;                                                                // 0x0028 (size: 0x4)
    bool LoopFlg;                                                                     // 0x002C (size: 0x1)
    bool TurnFlg;                                                                     // 0x002D (size: 0x1)
    bool MoveStartFlg;                                                                // 0x002E (size: 0x1)
    int32 StartLoopIndex;                                                             // 0x0030 (size: 0x4)
    float StartWaitTime;                                                              // 0x0034 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE StartTimeZoneType;                                         // 0x0038 (size: 0x1)
    float WaitTime1;                                                                  // 0x003C (size: 0x4)
    EKSCharacterDir WaitDir1;                                                         // 0x0040 (size: 0x1)
    EKSCharacterAction WaitMotion1;                                                   // 0x0041 (size: 0x1)
    float WaitTime2;                                                                  // 0x0044 (size: 0x4)
    EKSCharacterDir WaitDir2;                                                         // 0x0048 (size: 0x1)
    EKSCharacterAction WaitMotion2;                                                   // 0x0049 (size: 0x1)
    float WaitTime3;                                                                  // 0x004C (size: 0x4)
    EKSCharacterDir WaitDir3;                                                         // 0x0050 (size: 0x1)
    EKSCharacterAction WaitMotion3;                                                   // 0x0051 (size: 0x1)
    float WaitTime4;                                                                  // 0x0054 (size: 0x4)
    EKSCharacterDir WaitDir4;                                                         // 0x0058 (size: 0x1)
    EKSCharacterAction WaitMotion4;                                                   // 0x0059 (size: 0x1)
    float WaitTime5;                                                                  // 0x005C (size: 0x4)
    EKSCharacterDir WaitDir5;                                                         // 0x0060 (size: 0x1)
    EKSCharacterAction WaitMotion5;                                                   // 0x0061 (size: 0x1)
    float WaitTime6;                                                                  // 0x0064 (size: 0x4)
    EKSCharacterDir WaitDir6;                                                         // 0x0068 (size: 0x1)
    EKSCharacterAction WaitMotion6;                                                   // 0x0069 (size: 0x1)
    float WaitTime7;                                                                  // 0x006C (size: 0x4)
    EKSCharacterDir WaitDir7;                                                         // 0x0070 (size: 0x1)
    EKSCharacterAction WaitMotion7;                                                   // 0x0071 (size: 0x1)
    EKSCharacterMoveMode MoveMotion1;                                                 // 0x0072 (size: 0x1)
    float MoveSpeed1;                                                                 // 0x0074 (size: 0x4)
    EKSCharacterMoveMode MoveMotion2;                                                 // 0x0078 (size: 0x1)
    float MoveSpeed2;                                                                 // 0x007C (size: 0x4)
    EKSCharacterMoveMode MoveMotion3;                                                 // 0x0080 (size: 0x1)
    float MoveSpeed3;                                                                 // 0x0084 (size: 0x4)
    EKSCharacterMoveMode MoveMotion4;                                                 // 0x0088 (size: 0x1)
    float MoveSpeed4;                                                                 // 0x008C (size: 0x4)
    EKSCharacterMoveMode MoveMotion5;                                                 // 0x0090 (size: 0x1)
    float MoveSpeed5;                                                                 // 0x0094 (size: 0x4)
    EKSCharacterMoveMode MoveMotion6;                                                 // 0x0098 (size: 0x1)
    float MoveSpeed6;                                                                 // 0x009C (size: 0x4)

}; // Size: 0xA0

struct FFlagOverrideData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<int32> TargetEventFlags;                                                   // 0x0010 (size: 0x10)
    bool PeriodPlayingEvent;                                                          // 0x0020 (size: 0x1)
    bool PeriodPlayingTheater;                                                        // 0x0021 (size: 0x1)
    bool PeriodReminiPrologue;                                                        // 0x0022 (size: 0x1)
    bool PeriodReminiPast;                                                            // 0x0023 (size: 0x1)
    bool OverrideValue;                                                               // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FFlagRandomControlCandidate
{
    int32 Flag;                                                                       // 0x0000 (size: 0x4)
    int32 Rate;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFlagRandomControlGroup : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 ControlBeginFlag;                                                           // 0x000C (size: 0x4)
    int32 ControlEndFlag;                                                             // 0x0010 (size: 0x4)
    EFlagRandomControlTrigger ControlTrigger;                                         // 0x0014 (size: 0x1)
    bool ApplyValue;                                                                  // 0x0015 (size: 0x1)
    TArray<FFlagRandomControlCandidate> ControlCandidate;                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FFlipbookCalcData
{
    FVector2D MaxSpriteSize;                                                          // 0x0000 (size: 0x8)
    float RightMaxOffset;                                                             // 0x0008 (size: 0x4)
    float LeftMaxOffset;                                                              // 0x000C (size: 0x4)
    float TopMaxOffset;                                                               // 0x0010 (size: 0x4)
    float BottomMaxOffset;                                                            // 0x0014 (size: 0x4)
    FVector2D CustomPivot;                                                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FFlipbookPlayParam : public FTableRowBase
{
    FName CharacterName;                                                              // 0x0008 (size: 0x8)
    EKSCharacterAction ActionType;                                                    // 0x0010 (size: 0x1)
    EKSCharacterDir Dir;                                                              // 0x0011 (size: 0x1)
    bool IsLoop;                                                                      // 0x0012 (size: 0x1)

}; // Size: 0x18

struct FFollowNpcObjectData
{
    MJFieldCommandType FieldCommandType;                                              // 0x0000 (size: 0x1)
    class AKSCharacterBase* FollowCharacter;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FFontItemData
{
    TArray<class UObject*> FontObjList;                                               // 0x0000 (size: 0x10)
    bool Loaded;                                                                      // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FFootStepData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName WalkSELabel;                                                                // 0x000C (size: 0x8)
    FName DashSELabel;                                                                // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FForceFeedbackEffectVibrationData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    class UForceFeedbackEffect* VibrationAsset;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGameColorData : public FTableRowBase
{
    FLinearColor ColorValue;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGameConditionInfo
{
    FName PlayerLabel;                                                                // 0x0000 (size: 0x8)
    FName TargetLabel;                                                                // 0x0008 (size: 0x8)
    FName ItemLabel;                                                                  // 0x0010 (size: 0x8)
    int32 ItemCount;                                                                  // 0x0018 (size: 0x4)
    bool IsSolo;                                                                      // 0x001C (size: 0x1)

}; // Size: 0x20

struct FGameParamInfo : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString VarType;                                                                  // 0x0010 (size: 0x10)
    FString Min;                                                                      // 0x0020 (size: 0x10)
    FString Max;                                                                      // 0x0030 (size: 0x10)
    FString Init;                                                                     // 0x0040 (size: 0x10)
    FString Param;                                                                    // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FGameTextCharaInfo : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName Name;                                                                       // 0x000C (size: 0x8)
    EGENDER_TYPE Type;                                                                // 0x0014 (size: 0x1)
    FName Singular;                                                                   // 0x0018 (size: 0x8)
    FName SingularIndefinite;                                                         // 0x0020 (size: 0x8)
    FName SingularName;                                                               // 0x0028 (size: 0x8)
    FName Plural;                                                                     // 0x0030 (size: 0x8)
    FName PluralIndefinite;                                                           // 0x0038 (size: 0x8)
    FName PluralName;                                                                 // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FGameTextInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FText Text;                                                                       // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FGameTextItemInfo : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName Name;                                                                       // 0x000C (size: 0x8)
    FName Singular;                                                                   // 0x0014 (size: 0x8)
    FName SingularIndefinite;                                                         // 0x001C (size: 0x8)
    FName SingularName;                                                               // 0x0024 (size: 0x8)
    FName Plural;                                                                     // 0x002C (size: 0x8)
    FName PluralIndefinite;                                                           // 0x0034 (size: 0x8)
    FName PluralName;                                                                 // 0x003C (size: 0x8)

}; // Size: 0x48

struct FGiftData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName GiftTitle;                                                                  // 0x000C (size: 0x8)
    EGiftType GiftType;                                                               // 0x0014 (size: 0x1)
    int32 ReceivedFlag;                                                               // 0x0018 (size: 0x4)
    TArray<FGiftItemDataSet> ItemDataSets;                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGiftItemDataSet
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    int32 ItemNum;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGuideData
{
    ECONTROL_GUIDE_BUTTON_TYPE m_eButtonType;                                         // 0x0000 (size: 0x1)
    FName m_Name;                                                                     // 0x0004 (size: 0x8)
    bool m_IsForceDisplay;                                                            // 0x000C (size: 0x1)

}; // Size: 0x10

struct FGuildData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName GuildName;                                                                  // 0x000C (size: 0x8)
    FName GuildNpcLabel;                                                              // 0x0014 (size: 0x8)
    FName WorldMapLocation;                                                           // 0x001C (size: 0x8)
    FName LicenseItem;                                                                // 0x0024 (size: 0x8)
    FName GuildStampLabel;                                                            // 0x002C (size: 0x8)
    FName JobIconLabel;                                                               // 0x0034 (size: 0x8)
    FName FistTaskEvent;                                                              // 0x003C (size: 0x8)
    FName FirstReconfirm;                                                             // 0x0044 (size: 0x8)
    TArray<FJobLicenseData> JobLicenseData;                                           // 0x0050 (size: 0x10)
    TArray<FGuildTalkData> GuildTalkData;                                             // 0x0060 (size: 0x10)
    TArray<FName> CompleteEvent;                                                      // 0x0070 (size: 0x10)
    bool OpenGuildMenu;                                                               // 0x0080 (size: 0x1)
    bool UnVisitedShowRadarIcon;                                                      // 0x0081 (size: 0x1)
    int32 OverrideEmotion;                                                            // 0x0084 (size: 0x4)

}; // Size: 0x88

struct FGuildTalkData
{
    FName Title;                                                                      // 0x0000 (size: 0x8)
    FName TalkEvent;                                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FInvadeData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 InvadeID;                                                                   // 0x000C (size: 0x4)
    FName DisplayName;                                                                // 0x0010 (size: 0x8)
    FName DetailText;                                                                 // 0x0018 (size: 0x8)
    FName ResourceLabel;                                                              // 0x0020 (size: 0x8)
    bool InverseFlipBook;                                                             // 0x0028 (size: 0x1)
    FName Voice;                                                                      // 0x002C (size: 0x8)
    int32 DisplayLevel;                                                               // 0x0034 (size: 0x4)
    int32 CountMin;                                                                   // 0x0038 (size: 0x4)
    int32 CountMax;                                                                   // 0x003C (size: 0x4)
    bool UnlimitedFlag;                                                               // 0x0040 (size: 0x1)
    ECHARACTER_SIZE Size;                                                             // 0x0041 (size: 0x1)
    bool PartnerFlag;                                                                 // 0x0042 (size: 0x1)
    bool NPCFlag;                                                                     // 0x0043 (size: 0x1)
    bool LegendFlag;                                                                  // 0x0044 (size: 0x1)
    bool JuvenileFlg;                                                                 // 0x0045 (size: 0x1)
    bool LSizeFlag;                                                                   // 0x0046 (size: 0x1)
    bool InventorItemFlag;                                                            // 0x0047 (size: 0x1)
    EWEAPON_STANCE WeaponStance;                                                      // 0x0048 (size: 0x1)
    FName WeaponLabel;                                                                // 0x004C (size: 0x8)
    FCharacterParam Parameter;                                                        // 0x0054 (size: 0x34)
    FVector EffectOffset;                                                             // 0x0088 (size: 0xC)
    TArray<FName> AbilityList;                                                        // 0x0098 (size: 0x10)
    EWEAPON_CATEGORY WeaponType;                                                      // 0x00A8 (size: 0x1)
    TSoftClassPtr<UBattleAIBase> BattleAIPartner;                                     // 0x00B0 (size: 0x28)
    FVector2D MonsterUIOffset;                                                        // 0x00D8 (size: 0x8)
    FVector2D MonsterUISize;                                                          // 0x00E0 (size: 0x8)
    bool EnableProcess;                                                               // 0x00E8 (size: 0x1)
    FName ProcessedItem;                                                              // 0x00EC (size: 0x8)
    int32 ProcessNumID;                                                               // 0x00F4 (size: 0x4)
    int32 WaitEnemyActionFrame;                                                       // 0x00F8 (size: 0x4)
    FName InvadeAwakingLabel;                                                         // 0x00FC (size: 0x8)
    bool AwakingBoost0;                                                               // 0x0104 (size: 0x1)
    bool AwakingBoost1;                                                               // 0x0105 (size: 0x1)
    bool AwakingBoost2;                                                               // 0x0106 (size: 0x1)
    bool AwakingBoost3;                                                               // 0x0107 (size: 0x1)
    bool DisableAttackCommand;                                                        // 0x0108 (size: 0x1)
    bool DisableRecoveryCommand;                                                      // 0x0109 (size: 0x1)
    bool DisableReviveCommand;                                                        // 0x010A (size: 0x1)
    FProcessEnemyEventData ProcessEnemyEventData;                                     // 0x010C (size: 0x18)

}; // Size: 0x128

struct FInventionData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName InventionItemlabel;                                                         // 0x000C (size: 0x8)
    FName LearnAbilitylabel;                                                          // 0x0014 (size: 0x8)
    TArray<FInventionMaterial> Materials;                                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FInventionMaterial
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    int32 RequiredCount;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FInventorItemData : public FTableRowBase
{
    bool m_bInventorItemReady;                                                        // 0x0008 (size: 0x1)
    bool m_bExecCreate;                                                               // 0x0009 (size: 0x1)
    int32 m_nInventorTurn;                                                            // 0x000C (size: 0x4)
    int32 m_nInventorTurnMax;                                                         // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FItemAcquisitionHistory
{
    TArray<int32> History;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FItemCategory : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString DisplayNameID;                                                            // 0x0010 (size: 0x10)
    class UTexture2D* IconTexture;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FItemData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ItemNameID;                                                                 // 0x000C (size: 0x8)
    FName DetailTextID;                                                               // 0x0014 (size: 0x8)
    FName IconLabel;                                                                  // 0x001C (size: 0x8)
    EItemCategoryData ItemCategory;                                                   // 0x0024 (size: 0x1)
    int32 SortCategory;                                                               // 0x0028 (size: 0x4)
    int32 BackpackPriority;                                                           // 0x002C (size: 0x4)
    EITEM_DISPLAY_TYPE DisplayType;                                                   // 0x0030 (size: 0x1)
    EITEM_USE_TYPE UseType;                                                           // 0x0031 (size: 0x1)
    int32 MaxNum;                                                                     // 0x0034 (size: 0x4)
    FName SpecialItemLabel;                                                           // 0x0038 (size: 0x8)
    EBATTLE_TARGET_TYPE TargetType;                                                   // 0x0040 (size: 0x1)
    EATTRIBUTE_TYPE Attribute;                                                        // 0x0041 (size: 0x1)
    TArray<FAilmentHandler> Ailment;                                                  // 0x0048 (size: 0x10)
    bool ValuableFlag;                                                                // 0x0058 (size: 0x1)
    int32 BuyPrice;                                                                   // 0x005C (size: 0x4)
    int32 SellPrice;                                                                  // 0x0060 (size: 0x4)
    int32 BuyMeetCount;                                                               // 0x0064 (size: 0x4)
    int32 SellMeetCount;                                                              // 0x0068 (size: 0x4)
    EEquipmentCategory EquipmentCategory;                                             // 0x006C (size: 0x1)
    FName EquipmentTextureLabel;                                                      // 0x0070 (size: 0x8)
    FCharacterParam EquipmentRevision;                                                // 0x0078 (size: 0x34)
    TArray<EATTRIBUTE_RESIST> AttributeResist;                                        // 0x00B0 (size: 0x10)
    TArray<bool> DiseaseResist;                                                       // 0x00C0 (size: 0x10)
    class UDataTable* CommandEffecter;                                                // 0x00D0 (size: 0x8)
    TSoftObjectPtr<ULevelSequence> ActionCommandSequencer;                            // 0x00D8 (size: 0x28)
    FString TextInfoLabel;                                                            // 0x0100 (size: 0x10)
    bool DisableAttackCommand;                                                        // 0x0110 (size: 0x1)
    bool DisableRecoveryCommand;                                                      // 0x0111 (size: 0x1)
    bool DisableReviveCommand;                                                        // 0x0112 (size: 0x1)
    FName AbilityLabel;                                                               // 0x0114 (size: 0x8)
    int32 DebugRecommendLv;                                                           // 0x011C (size: 0x4)

}; // Size: 0x120

struct FItemDataForMenu : public FTableRowBase
{
    class UTexture2D* IconTexture;                                                    // 0x0008 (size: 0x8)
    FName IconLabel;                                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FItemIconText : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FText IconText;                                                                   // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FItemInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString Label;                                                                    // 0x0010 (size: 0x10)
    int32 DisplayName;                                                                // 0x0020 (size: 0x4)
    class UTexture2D* IconTexture;                                                    // 0x0028 (size: 0x8)
    int32 Detail;                                                                     // 0x0030 (size: 0x4)
    int32 Category;                                                                   // 0x0034 (size: 0x4)
    int32 UsePoint;                                                                   // 0x0038 (size: 0x4)
    int32 EffectRange;                                                                // 0x003C (size: 0x4)
    int32 Attribute;                                                                  // 0x0040 (size: 0x4)
    TArray<int32> EffectValue;                                                        // 0x0048 (size: 0x10)
    int32 SpecialEffect;                                                              // 0x0058 (size: 0x4)
    int32 SaleMoney;                                                                  // 0x005C (size: 0x4)
    int32 SellHitDetail;                                                              // 0x0060 (size: 0x4)
    TArray<int32> CalcSellHitValue;                                                   // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FJobCalcData
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    bool ReleaseFlag;                                                                 // 0x0008 (size: 0x1)
    TArray<int32> EquipCharaIDs;                                                      // 0x0010 (size: 0x10)
    int32 Num;                                                                        // 0x0020 (size: 0x4)
    int32 MaxNum;                                                                     // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FJobData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 JobID;                                                                      // 0x000C (size: 0x4)
    FName DisplayName;                                                                // 0x0010 (size: 0x8)
    FName Detail;                                                                     // 0x0018 (size: 0x8)
    int32 DisplayOrder;                                                               // 0x0020 (size: 0x4)
    FName MenuJobIcon;                                                                // 0x0024 (size: 0x8)
    FName AbilityJobIcon;                                                             // 0x002C (size: 0x8)
    int32 PermissionFlag;                                                             // 0x0034 (size: 0x4)
    FName EquipJobItem;                                                               // 0x0038 (size: 0x8)
    TArray<bool> ProperEquipment;                                                     // 0x0040 (size: 0x10)
    FCharacterParam ParameterRevision;                                                // 0x0050 (size: 0x34)
    FName JobCommandName;                                                             // 0x0084 (size: 0x8)
    FName JobCommandDetail;                                                           // 0x008C (size: 0x8)
    TArray<FJobLearnAbility> JobCommandAbility;                                       // 0x0098 (size: 0x10)
    TArray<FJobLearnAbility> JobSupportAbility;                                       // 0x00A8 (size: 0x10)
    TArray<int32> JPCost;                                                             // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FJobEvalautionValueData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    float HP;                                                                         // 0x000C (size: 0x4)
    float MP;                                                                         // 0x0010 (size: 0x4)
    float ATK;                                                                        // 0x0014 (size: 0x4)
    float DEF;                                                                        // 0x0018 (size: 0x4)
    float MATK;                                                                       // 0x001C (size: 0x4)
    float MDEF;                                                                       // 0x0020 (size: 0x4)
    float ACC;                                                                        // 0x0024 (size: 0x4)
    float EVA;                                                                        // 0x0028 (size: 0x4)
    float CON;                                                                        // 0x002C (size: 0x4)
    float AGI;                                                                        // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FJobLearnAbility : public FTableRowBase
{
    FName AbilityName;                                                                // 0x0008 (size: 0x8)
    int32 GetParam;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FJobLicenseData
{
    FName TaskTitle;                                                                  // 0x0000 (size: 0x8)
    FName NeedItemLabel;                                                              // 0x0008 (size: 0x8)
    int32 NeedItemNum;                                                                // 0x0010 (size: 0x4)
    int32 NeedMoney;                                                                  // 0x0014 (size: 0x4)
    FName NeedAbility;                                                                // 0x0018 (size: 0x8)
    int32 LearnedCount;                                                               // 0x0020 (size: 0x4)
    FName TaskDescription;                                                            // 0x0024 (size: 0x8)

}; // Size: 0x2C

struct FJumpFrameSet
{
    int32 KEN;                                                                        // 0x0000 (size: 0x4)
    int32 KAR;                                                                        // 0x0004 (size: 0x4)
    int32 KUS;                                                                        // 0x0008 (size: 0x4)
    int32 Sin;                                                                        // 0x000C (size: 0x4)
    int32 SHO;                                                                        // 0x0010 (size: 0x4)
    int32 GAK;                                                                        // 0x0014 (size: 0x4)
    int32 TOU;                                                                        // 0x0018 (size: 0x4)
    int32 ODO;                                                                        // 0x001C (size: 0x4)

}; // Size: 0x20

struct FKSCategoryVolumeData
{
}; // Size: 0x28

struct FKSCharaFlipbook : public FTableRowBase
{
    TArray<FName> FlipbookNames;                                                      // 0x0008 (size: 0x10)
    TArray<bool> Loop;                                                                // 0x0018 (size: 0x10)
    float Height;                                                                     // 0x0028 (size: 0x4)
    FName WalkFootstep;                                                               // 0x002C (size: 0x8)
    TArray<TSoftObjectPtr<UTexture2D>> Textures;                                      // 0x0038 (size: 0x10)
    TArray<TSoftObjectPtr<UMaterialInterface>> Materials;                             // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FKSCueSheetData : public FTableRowBase
{
    FName AssetPath;                                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FKSFlipbookData : public FTableRowBase
{
    float Fps;                                                                        // 0x0008 (size: 0x4)
    TArray<FKSFlipbookKeyFrame> KeyFrames;                                            // 0x0010 (size: 0x10)
    TSoftObjectPtr<UMaterialInterface> Material;                                      // 0x0020 (size: 0x28)

}; // Size: 0x48

struct FKSFlipbookKeyFrame
{
    FName SpriteName;                                                                 // 0x0000 (size: 0x8)
    int32 FrameRun;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FKSKeyConfigMappingDatum
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    float Scale;                                                                      // 0x0008 (size: 0x4)
    bool Axis;                                                                        // 0x000C (size: 0x1)
    FName Category;                                                                   // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FKSLevelPostProcessData
{
    TWeakObjectPtr<class APostProcessVolume> Volume;                                  // 0x0000 (size: 0x8)
    float VignetteWeak;                                                               // 0x0008 (size: 0x4)
    float VignetteNormal;                                                             // 0x000C (size: 0x4)
    float FocalRegionWide;                                                            // 0x0010 (size: 0x4)
    float FocalRegionNormal;                                                          // 0x0014 (size: 0x4)
    float DofScaleWeak;                                                               // 0x0018 (size: 0x4)
    float DofScaleNormal;                                                             // 0x001C (size: 0x4)
    float ColorGradingGainNormal;                                                     // 0x0020 (size: 0x4)
    float ColorGradingGainMin;                                                        // 0x0024 (size: 0x4)
    float ColorGradingGainMax;                                                        // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FKSObjectData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    uint8 ObjectType;                                                                 // 0x000C (size: 0x1)
    FName ObjResLabel;                                                                // 0x0010 (size: 0x8)
    bool IsCollision;                                                                 // 0x0018 (size: 0x1)
    bool IsPutOnGround;                                                               // 0x0019 (size: 0x1)
    bool IsMoney;                                                                     // 0x001A (size: 0x1)
    FName HaveItemLabel;                                                              // 0x001C (size: 0x8)
    int32 HaveItemCnt;                                                                // 0x0024 (size: 0x4)
    bool HideDialog;                                                                  // 0x0028 (size: 0x1)
    bool IsRevivalByLevelChange;                                                      // 0x0029 (size: 0x1)
    TArray<FRandomItemData> RandomItemCandidates;                                     // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FKSSaveSlotData
{
    int32 PlayTime;                                                                   // 0x0000 (size: 0x4)
    int32 SaveDate_Year;                                                              // 0x0004 (size: 0x4)
    int32 SaveDate_Month;                                                             // 0x0008 (size: 0x4)
    int32 SaveDate_Day;                                                               // 0x000C (size: 0x4)
    int32 SaveDate_Hour;                                                              // 0x0010 (size: 0x4)
    int32 SaveDate_Minute;                                                            // 0x0014 (size: 0x4)
    int32 SaveDate_Second;                                                            // 0x0018 (size: 0x4)
    int32 levelId;                                                                    // 0x001C (size: 0x4)
    int32 LevelAreaID;                                                                // 0x0020 (size: 0x4)
    int32 ClearFlag;                                                                  // 0x0024 (size: 0x4)
    int32 LeaderCharaLevel;                                                           // 0x0028 (size: 0x4)
    TArray<int32> MainMemberCharacterID;                                              // 0x0030 (size: 0x10)
    TArray<int32> MainMemberJobID;                                                    // 0x0040 (size: 0x10)
    TArray<uint8> CharaForm;                                                          // 0x0050 (size: 0x10)
    bool IsEnabled;                                                                   // 0x0060 (size: 0x1)
    bool IsAutoSaveLine;                                                              // 0x0061 (size: 0x1)
    bool IsForcusAnimImmideate;                                                       // 0x0062 (size: 0x1)
    bool IsInReminiscence;                                                            // 0x0063 (size: 0x1)
    int32 ReminiscenceStoryIndex;                                                     // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FKSSpriteData : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> SrcTexture;                                            // 0x0008 (size: 0x28)
    FVector2D SrcUV;                                                                  // 0x0030 (size: 0x8)
    FVector2D SrcSize;                                                                // 0x0038 (size: 0x8)
    TArray<TSoftObjectPtr<UTexture2D>> AddTexArray;                                   // 0x0040 (size: 0x10)
    TArray<FVector4> VertArray;                                                       // 0x0050 (size: 0x10)
    TArray<FName> SocketNameArray;                                                    // 0x0060 (size: 0x10)
    TArray<FVector> SocketPosArray;                                                   // 0x0070 (size: 0x10)
    FVector2D CharaFootPivot;                                                         // 0x0080 (size: 0x8)
    bool HasAdditionalTexture;                                                        // 0x0088 (size: 0x1)
    float CustomPixelsPerUnrealUnit;                                                  // 0x008C (size: 0x4)

}; // Size: 0x90

struct FKSSysSaveData
{
    TArray<int32> BitFlags;                                                           // 0x0000 (size: 0x10)
    TArray<int32> Params;                                                             // 0x0010 (size: 0x10)
    TArray<int32> KeyConfigParam;                                                     // 0x0020 (size: 0x10)
    int32 KeyConfigKeyboardLayoutType;                                                // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FKSUICommonDialogParam
{
    FText CaptionText;                                                                // 0x0000 (size: 0x18)
    bool UseCaption;                                                                  // 0x0018 (size: 0x1)
    FText DetailText;                                                                 // 0x0020 (size: 0x18)
    bool UseDetail;                                                                   // 0x0038 (size: 0x1)
    TArray<FText> ButtonText;                                                         // 0x0040 (size: 0x10)
    int32 DefaultButton;                                                              // 0x0050 (size: 0x4)
    bool EnableCancelKey;                                                             // 0x0054 (size: 0x1)
    int32 CancelKeyValue;                                                             // 0x0058 (size: 0x4)
    bool AutoSelectClose;                                                             // 0x005C (size: 0x1)
    bool AutoClosePop;                                                                // 0x005D (size: 0x1)

}; // Size: 0x60

struct FKSUIFlipbookData : public FTableRowBase
{
    float Fps;                                                                        // 0x0008 (size: 0x4)
    TArray<FKSFlipbookKeyFrame> KeyFrames;                                            // 0x0010 (size: 0x10)
    TSoftObjectPtr<UMaterialInterface> Material;                                      // 0x0020 (size: 0x28)
    class UPaperFlipbook* flipbook;                                                   // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FLabelListData : public FTableRowBase
{
    TArray<FName> LabelList;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FLanternCheckData
{
    int32 EventFlag;                                                                  // 0x0000 (size: 0x4)
    bool Equip;                                                                       // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FLevelInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    uint8 LevelKind;                                                                  // 0x000C (size: 0x1)
    uint8 AreaID;                                                                     // 0x000D (size: 0x1)
    int32 TownLabel;                                                                  // 0x0010 (size: 0x4)
    int32 SubTownLabel;                                                               // 0x0014 (size: 0x4)
    int32 MapChangeType;                                                              // 0x0018 (size: 0x4)
    uint8 TransportationType;                                                         // 0x001C (size: 0x1)
    int32 EncountStepMin;                                                             // 0x0020 (size: 0x4)
    int32 RandomStepA;                                                                // 0x0024 (size: 0x4)
    int32 RandomStepB;                                                                // 0x0028 (size: 0x4)
    float FirstEncountStepRatio;                                                      // 0x002C (size: 0x4)
    FName BgmLabelDayTime;                                                            // 0x0030 (size: 0x8)
    FName BgmLabelNight;                                                              // 0x0038 (size: 0x8)
    FName BgmLabelDarkness;                                                           // 0x0040 (size: 0x8)
    FName Bgm2Label;                                                                  // 0x0048 (size: 0x8)
    int32 Bgm2EnableFlag;                                                             // 0x0050 (size: 0x4)
    FName Bgm3Label;                                                                  // 0x0054 (size: 0x8)
    int32 Bgm3EnableFlag;                                                             // 0x005C (size: 0x4)
    FName Bgm4Label;                                                                  // 0x0060 (size: 0x8)
    int32 Bgm4EnableFlag;                                                             // 0x0068 (size: 0x4)
    FName Bgm5Label;                                                                  // 0x006C (size: 0x8)
    int32 Bgm5EnableFlag;                                                             // 0x0074 (size: 0x4)
    FName TimeZoneChangeSeLabel;                                                      // 0x0078 (size: 0x8)
    FName TimeZoneChangeSe2Label;                                                     // 0x0080 (size: 0x8)
    int32 TimeZoneChangeSe2EnableFlag;                                                // 0x0088 (size: 0x4)
    int32 ScreenFadeInTime;                                                           // 0x008C (size: 0x4)
    int32 ScreenFadeOutTime;                                                          // 0x0090 (size: 0x4)
    int32 EncountOffset;                                                              // 0x0094 (size: 0x4)
    TArray<FName> BattleMapNameList;                                                  // 0x0098 (size: 0x10)
    TArray<FName> EncountVolumeNameList;                                              // 0x00A8 (size: 0x10)
    FName DarkAreaEncountVolumeName;                                                  // 0x00B8 (size: 0x8)
    float Intencity;                                                                  // 0x00C0 (size: 0x4)
    float AttenuationRadius;                                                          // 0x00C4 (size: 0x4)
    FLinearColor LightColor;                                                          // 0x00C8 (size: 0x10)
    float SourceRadius;                                                               // 0x00D8 (size: 0x4)
    bool TorchFlag;                                                                   // 0x00DC (size: 0x1)
    bool ImpossibleTimeZoneChangeFlag;                                                // 0x00DD (size: 0x1)
    int32 TimeZoneSeqChangeFlag;                                                      // 0x00E0 (size: 0x4)
    FName ReplaceTimeZoneSeqLabel;                                                    // 0x00E4 (size: 0x8)
    bool ReverbFlag;                                                                  // 0x00EC (size: 0x1)
    bool ImpossibleFCFlag;                                                            // 0x00ED (size: 0x1)
    TArray<bool> BarPlacementChara;                                                   // 0x00F0 (size: 0x10)
    TArray<float> BarPCPos1;                                                          // 0x0100 (size: 0x10)
    uint8 BarPCDir1;                                                                  // 0x0110 (size: 0x1)
    TArray<float> BarPCPos2;                                                          // 0x0118 (size: 0x10)
    uint8 BarPCDir2;                                                                  // 0x0128 (size: 0x1)
    FName BarItemLabel1;                                                              // 0x012C (size: 0x8)
    int32 BarItemCnt1;                                                                // 0x0134 (size: 0x4)
    FName BarItemLabel2;                                                              // 0x0138 (size: 0x8)
    int32 BarItemCnt2;                                                                // 0x0140 (size: 0x4)
    FName BarItemLabel3;                                                              // 0x0144 (size: 0x8)
    int32 BarItemCnt3;                                                                // 0x014C (size: 0x4)
    FName BarEventLabel;                                                              // 0x0150 (size: 0x8)
    bool BanLostWay;                                                                  // 0x0158 (size: 0x1)
    bool BanMainMenuPartyMemberChange;                                                // 0x0159 (size: 0x1)

}; // Size: 0x160

struct FLevelLoaderRequest
{
}; // Size: 0x20

struct FLevelResolutioData : public FTableRowBase
{
    float SwitchHandheldScreenPercentage;                                             // 0x0008 (size: 0x4)
    float SwitchHandheldSeparateTranslucencyScreenPercentage;                         // 0x000C (size: 0x4)
    float SwitchTVScreenPercentage;                                                   // 0x0010 (size: 0x4)
    float SwitchTVSeparateTranslucencyScreenPercentage;                               // 0x0014 (size: 0x4)
    float PS4ScreenPercentage;                                                        // 0x0018 (size: 0x4)
    float PS4SeparateTranslucencyScreenPercentage;                                    // 0x001C (size: 0x4)

}; // Size: 0x20

struct FLevelTransitionData
{
    int32 EnableFlag;                                                                 // 0x0000 (size: 0x4)
    FName NextMapName;                                                                // 0x0004 (size: 0x8)
    ELevelTriggerID NextLevelTriggerID;                                               // 0x000C (size: 0x1)
    EKSCharacterDir MapInCharaDir;                                                    // 0x000D (size: 0x1)
    ECharacterMoveModeForDB MapInCharaMoveMode;                                       // 0x000E (size: 0x1)
    FName NextMapNoticeText;                                                          // 0x0010 (size: 0x8)
    bool EnableAutoSave;                                                              // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FLevelTriggerParams : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName NextMapName;                                                                // 0x000C (size: 0x8)
    ELevelTriggerID NextLevelTriggerID;                                               // 0x0014 (size: 0x1)
    EKSCharacterDir MapInCharaDir;                                                    // 0x0015 (size: 0x1)
    ECharacterMoveModeForDB MapInCharaMoveMode;                                       // 0x0016 (size: 0x1)
    FName NextMapNoticeText;                                                          // 0x0018 (size: 0x8)
    bool EnableAutoSave;                                                              // 0x0020 (size: 0x1)
    TArray<FLevelTransitionData> ConditionalTransitionData;                           // 0x0028 (size: 0x10)
    TArray<int32> FlagList;                                                           // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FLinerShipRouteData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ContinentA;                                                                 // 0x000C (size: 0x8)
    FName ContinentB;                                                                 // 0x0014 (size: 0x8)
    FName LevelA;                                                                     // 0x001C (size: 0x8)
    FName LevelB;                                                                     // 0x0024 (size: 0x8)
    FName LevelTriggerA;                                                              // 0x002C (size: 0x8)
    FName LevelTriggerB;                                                              // 0x0034 (size: 0x8)
    int32 Price;                                                                      // 0x003C (size: 0x4)
    FName EventRouteAtoB;                                                             // 0x0040 (size: 0x8)
    FName EventRouteBtoA;                                                             // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FListWidgetCategory : public FTableRowBase
{
    class UTexture2D* TabIcon;                                                        // 0x0008 (size: 0x8)
    class UTexture2D* TitleIcon;                                                      // 0x0010 (size: 0x8)
    bool UseCaptionFormat;                                                            // 0x0018 (size: 0x1)
    FName ListCaptionFormat;                                                          // 0x001C (size: 0x8)
    FName ListCaption;                                                                // 0x0024 (size: 0x8)
    FName Column1_Title;                                                              // 0x002C (size: 0x8)
    FName Column2_Title;                                                              // 0x0034 (size: 0x8)
    bool Column2_Visible;                                                             // 0x003C (size: 0x1)
    FName Column3_Title;                                                              // 0x0040 (size: 0x8)
    bool Column3_Visible;                                                             // 0x0048 (size: 0x1)
    int32 CategoryId;                                                                 // 0x004C (size: 0x4)
    bool ShowAllItem;                                                                 // 0x0050 (size: 0x1)
    bool ShowAlways;                                                                  // 0x0051 (size: 0x1)
    bool ShowNewItems;                                                                // 0x0052 (size: 0x1)
    bool HolyTorchFlag;                                                               // 0x0053 (size: 0x1)
    bool EnableCategoryUpdate;                                                        // 0x0054 (size: 0x1)

}; // Size: 0x58

struct FLoadedObject
{
    TArray<class UObject*> LoadedObject;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLoopSeData : public FTableRowBase
{
    class UAtomComponent* Component;                                                  // 0x0008 (size: 0x8)
    bool IsUsed;                                                                      // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FMAINMENU_MISSION_RECORD_DATA
{
    FName MissionLabel;                                                               // 0x0000 (size: 0x8)
    int32 State;                                                                      // 0x0008 (size: 0x4)
    int32 ClearIdx;                                                                   // 0x000C (size: 0x4)
    int32 SaveDataIndex;                                                              // 0x0010 (size: 0x4)
    bool bNewFlag;                                                                    // 0x0014 (size: 0x1)
    bool bIsReminiscence;                                                             // 0x0015 (size: 0x1)
    FName DetailTextLabel;                                                            // 0x0018 (size: 0x8)
    FName WorldMapIconLabel;                                                          // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FMJActivitySaveData
{
    TMap<int32, int32> SubTaskStatus;                                                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FMJGameTextMap
{
    TMap<class FString, class FName> TextMap;                                         // 0x0000 (size: 0x50)
    bool IsReady;                                                                     // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FMJListWidgetItemData : public FTableRowBase
{
    FText ItemName;                                                                   // 0x0008 (size: 0x18)
    FName ItemNameLabel;                                                              // 0x0020 (size: 0x8)
    FText ItemData_0;                                                                 // 0x0028 (size: 0x18)
    FText ItemData_1;                                                                 // 0x0040 (size: 0x18)
    class UTexture2D* ItemIcon;                                                       // 0x0058 (size: 0x8)
    class UTexture2D* ItemIcon_0;                                                     // 0x0060 (size: 0x8)
    FText DetailText;                                                                 // 0x0068 (size: 0x18)
    FName DetailTextLabel;                                                            // 0x0080 (size: 0x8)
    ELIST_ITEM_STATUS Status;                                                         // 0x0088 (size: 0x1)
    int32 CategoryId;                                                                 // 0x008C (size: 0x4)
    bool StrikeThrough;                                                               // 0x0090 (size: 0x1)
    int32 ItemNum_0;                                                                  // 0x0094 (size: 0x4)
    int32 ItemNum_1;                                                                  // 0x0098 (size: 0x4)
    ELIST_ITEM_NEXT_SPACE NextSpace;                                                  // 0x009C (size: 0x1)
    int32 Option_0;                                                                   // 0x00A0 (size: 0x4)
    bool NotShowAllCategory;                                                          // 0x00A4 (size: 0x1)
    bool DontSelectable;                                                              // 0x00A5 (size: 0x1)
    bool NoHelp;                                                                      // 0x00A6 (size: 0x1)
    bool ItemData_1_Dark;                                                             // 0x00A7 (size: 0x1)
    class UTexture2D* FixedEquipIcon;                                                 // 0x00A8 (size: 0x8)
    bool HolyTorchFlag;                                                               // 0x00B0 (size: 0x1)
    bool IsItemDetailText;                                                            // 0x00B1 (size: 0x1)
    bool IsUseSubItem;                                                                // 0x00B2 (size: 0x1)
    bool IsSoldOutItem;                                                               // 0x00B3 (size: 0x1)

}; // Size: 0xB8

struct FMJSpriteSocketData
{
    TArray<FPaperSpriteSocket> SocketList;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMJUICommonDialogParam
{
    FText CaptionText;                                                                // 0x0000 (size: 0x18)
    FText DetailText;                                                                 // 0x0018 (size: 0x18)
    TArray<FText> ButtonText;                                                         // 0x0030 (size: 0x10)
    int32 DefaultButton;                                                              // 0x0040 (size: 0x4)
    bool EnableCancelKey;                                                             // 0x0044 (size: 0x1)
    int32 CancelKeyValue;                                                             // 0x0048 (size: 0x4)
    bool AutoSelectClose;                                                             // 0x004C (size: 0x1)
    FMJUICommonDialogParamOnSelectCallback OnSelectCallback;                          // 0x0050 (size: 0x10)
    void SelectCallback(int32 SelectIndex);
    FMJUICommonDialogParamOnCloseFinishCallback OnCloseFinishCallback;                // 0x0060 (size: 0x10)
    void CloseFinishCallback(int32 SelectIndex);
    class UUserWidget* AttachDetailWidget;                                            // 0x0070 (size: 0x8)
    bool DetailOnTop;                                                                 // 0x0078 (size: 0x1)
    class UUserWidget* AttachCaptionWidget;                                           // 0x0080 (size: 0x8)
    bool CaptionOnTop;                                                                // 0x0088 (size: 0x1)
    bool UseCaptionSeparation;                                                        // 0x0089 (size: 0x1)
    bool RequestFlag;                                                                 // 0x008A (size: 0x1)
    bool DuplicationFlag;                                                             // 0x008B (size: 0x1)
    bool InputReceptionFlag;                                                          // 0x008C (size: 0x1)
    bool UseSelectWidget;                                                             // 0x008D (size: 0x1)
    bool SelectWidgetOnTop;                                                           // 0x008E (size: 0x1)
    TArray<class UUserWidget*> SelectWidgetList;                                      // 0x0090 (size: 0x10)
    bool BloodFlag;                                                                   // 0x00A0 (size: 0x1)
    TArray<bool> BloodList;                                                           // 0x00A8 (size: 0x10)
    bool EnableOpenSe;                                                                // 0x00B8 (size: 0x1)
    FName OpenSeLabel;                                                                // 0x00BC (size: 0x8)

}; // Size: 0xC8

struct FMainMissionData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName MainStoryLabel;                                                             // 0x000C (size: 0x8)
    ESTORY_TASK_TYPE TaskType;                                                        // 0x0014 (size: 0x1)
    EPlayableCharacterID TargetPCIndex;                                               // 0x0015 (size: 0x1)
    bool IsMissionList;                                                               // 0x0016 (size: 0x1)
    int32 ViewEventFlag;                                                              // 0x0018 (size: 0x4)
    float AddAchive;                                                                  // 0x001C (size: 0x4)
    FName MemoryEventLabel;                                                           // 0x0020 (size: 0x8)
    FName TitleTextLabel;                                                             // 0x0028 (size: 0x8)
    FName DetailTextLabel;                                                            // 0x0030 (size: 0x8)
    FName WorldMapIcon;                                                               // 0x0038 (size: 0x8)
    int32 ProgressValue;                                                              // 0x0040 (size: 0x4)
    bool UnavailableFastTravel;                                                       // 0x0044 (size: 0x1)
    FName AuthorizationFastTravel;                                                    // 0x0048 (size: 0x8)
    FName EventSoundLabel;                                                            // 0x0050 (size: 0x8)
    EEndRollSegmentSet EndRollSegment;                                                // 0x0058 (size: 0x1)
    int32 EventObjectFlag1;                                                           // 0x005C (size: 0x4)
    int32 EventObjectFlag2;                                                           // 0x0060 (size: 0x4)
    int32 EventObjectFlag3;                                                           // 0x0064 (size: 0x4)
    int32 EventObjectFlag4;                                                           // 0x0068 (size: 0x4)
    int32 EventObjectFlag5;                                                           // 0x006C (size: 0x4)
    int32 EventObjectFlag6;                                                           // 0x0070 (size: 0x4)
    int32 EventObjectFlag7;                                                           // 0x0074 (size: 0x4)
    int32 EventObjectFlag8;                                                           // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FMainSequenceStateParam
{
    class UObject* Object;                                                            // 0x0000 (size: 0x8)
    int32 Param0;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FMainSequneceRequestParam
{
    FMainSequneceRequestParamDelegate Delegate;                                       // 0x0000 (size: 0x10)
    void RequestDelegate(EREQUEST_RESULT Result);
    FMainSequenceStateParam StateParam;                                               // 0x0020 (size: 0x10)
    bool IsHold;                                                                      // 0x0030 (size: 0x1)
    EREQUEST_TYPE Type;                                                               // 0x0031 (size: 0x1)

}; // Size: 0x38

struct FMainStoryData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EPlayableCharacterID PlayerCharaId;                                               // 0x000C (size: 0x1)
    FName StartWMapLocation;                                                          // 0x0010 (size: 0x8)
    TArray<FStartWorldMapData> SwitchWMapLocation;                                    // 0x0018 (size: 0x10)
    TArray<EPlayableCharacterID> RelationCharaId;                                     // 0x0028 (size: 0x10)
    TArray<int32> ReleaseFlag;                                                        // 0x0038 (size: 0x10)
    bool ReleaseNoticeFlag;                                                           // 0x0048 (size: 0x1)
    int32 SealFlag;                                                                   // 0x004C (size: 0x4)
    EMAIN_STORY_CATEGORY StoryCategory;                                               // 0x0050 (size: 0x1)
    EEXTRA_STORY_CATEGORY ExStoryCategory;                                            // 0x0051 (size: 0x1)
    int32 ChapterIndex;                                                               // 0x0054 (size: 0x4)
    FName ChapterText;                                                                // 0x0058 (size: 0x8)
    FName SubTitleText;                                                               // 0x0060 (size: 0x8)
    FName StoryDetailText;                                                            // 0x0068 (size: 0x8)
    FName OpeningEvent;                                                               // 0x0070 (size: 0x8)
    TArray<int32> RecommendationPoint;                                                // 0x0078 (size: 0x10)
    int32 ClearDifficultyPoint;                                                       // 0x0088 (size: 0x4)
    bool RecoverSwoonOnClear;                                                         // 0x008C (size: 0x1)
    TArray<FName> RelationLevel;                                                      // 0x0090 (size: 0x10)
    TArray<int32> EventFlagRange;                                                     // 0x00A0 (size: 0x10)
    TArray<int32> OffEventFlagRange;                                                  // 0x00B0 (size: 0x10)
    TArray<FName> NotVisitedOnClear;                                                  // 0x00C0 (size: 0x10)
    TArray<FName> VisitedOnClear;                                                     // 0x00D0 (size: 0x10)

}; // Size: 0xE0

struct FMainStoryEventObjectData
{
}; // Size: 0x18

struct FMainStorySaveData
{
    int32 StoryID;                                                                    // 0x0000 (size: 0x4)
    int32 CurrentTaskID;                                                              // 0x0004 (size: 0x4)
    int32 State;                                                                      // 0x0008 (size: 0x4)
    bool ConfirmedFlag;                                                               // 0x000C (size: 0x1)

}; // Size: 0x10

struct FMainStoryTaskSaveData
{
    int32 PlayedTimeZone;                                                             // 0x0000 (size: 0x4)
    int32 State;                                                                      // 0x0004 (size: 0x4)
    int32 Flag;                                                                       // 0x0008 (size: 0x4)
    TArray<int32> EventFlagList;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMapChipBlockPosition
{
    int32 m_nPosX;                                                                    // 0x0000 (size: 0x4)
    int32 m_nPosY;                                                                    // 0x0004 (size: 0x4)
    int32 m_nPosZ;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMapData
{
    TArray<uint8> TreasureStateArray;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMapInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString Label;                                                                    // 0x0010 (size: 0x10)
    int32 MapNameID;                                                                  // 0x0020 (size: 0x4)
    FString levelName;                                                                // 0x0028 (size: 0x10)
    class UTexture2D* MiniMapAsset;                                                   // 0x0038 (size: 0x8)
    int32 RecommendMinLevel;                                                          // 0x0040 (size: 0x4)
    int32 RecommendMaxLevel;                                                          // 0x0044 (size: 0x4)
    int32 BGMID;                                                                      // 0x0048 (size: 0x4)
    int32 ScreenFadeInTime;                                                           // 0x004C (size: 0x4)
    int32 ScreenFadeOutTime;                                                          // 0x0050 (size: 0x4)
    int32 EncountOffset;                                                              // 0x0054 (size: 0x4)
    TArray<FString> BattleMapNameList;                                                // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FMateriaTextureLabel
{
    FName Acq_LabelForRuntime_AutoFill;                                               // 0x0000 (size: 0x8)
    FName Acq_LabelForRuntime;                                                        // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMenuData
{
    int32 MissionRecord_MainStartSelect;                                              // 0x0000 (size: 0x4)
    int32 MissionRecord_ExtraStartSelect;                                             // 0x0004 (size: 0x4)
    int32 MissionRecord_SubStartSelect;                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMillionaireModeData : public FTableRowBase
{
    FName ActiveEventFlag;                                                            // 0x0008 (size: 0x8)
    int64 Price;                                                                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMissionLabelList : public FTableRowBase
{
    TArray<FName> LabelArray;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMonsterListData : public FTableRowBase
{
    FName MonsterLabel;                                                               // 0x0008 (size: 0x8)
    int32 MonsterCount;                                                               // 0x0010 (size: 0x4)
    bool IsUnlimited;                                                                 // 0x0014 (size: 0x1)
    bool IsPartner;                                                                   // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FMyShipFlipbookData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EMYSHIP_CUSTOM_TYPE ColorType;                                                    // 0x000C (size: 0x1)
    EMYSHIP_CUSTOM_TYPE SailType;                                                     // 0x000D (size: 0x1)
    FName FlipbookName;                                                               // 0x0010 (size: 0x8)
    FName MeshResourceLabel;                                                          // 0x0018 (size: 0x8)
    FName OpenSailMeshResourceLabel;                                                  // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FNPCBattleData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 CommandEnable;                                                              // 0x000C (size: 0x4)
    FName EnemyGroupID;                                                               // 0x0010 (size: 0x8)
    TArray<int32> WinEventFlag;                                                       // 0x0018 (size: 0x10)
    TArray<int32> LoseEventFlag;                                                      // 0x0028 (size: 0x10)
    bool CanSwoon;                                                                    // 0x0038 (size: 0x1)
    FName SwoonTalkID;                                                                // 0x003C (size: 0x8)
    FName SleepTalkID;                                                                // 0x0044 (size: 0x8)
    TArray<FName> SwoonRecLevel;                                                      // 0x0050 (size: 0x10)
    bool SwoonRecTimeZoneChange;                                                      // 0x0060 (size: 0x1)
    TArray<int32> SwooningFlags;                                                      // 0x0068 (size: 0x10)
    int32 BattleNeedLevel;                                                            // 0x0078 (size: 0x4)
    int32 BattlePCTalk;                                                               // 0x007C (size: 0x4)
    FName PreBattleTalkID;                                                            // 0x0080 (size: 0x8)
    FName PreBattleEventID;                                                           // 0x0088 (size: 0x8)
    FName LoseBattleTalkID;                                                           // 0x0090 (size: 0x8)
    FName LearnAbility;                                                               // 0x0098 (size: 0x8)
    bool IsDeathMatch;                                                                // 0x00A0 (size: 0x1)
    bool IsGameOverWhenLoose;                                                         // 0x00A1 (size: 0x1)
    TArray<FName> AdditionalTargetNpc;                                                // 0x00A8 (size: 0x10)
    bool IsIgnoreLeanAbility;                                                         // 0x00B8 (size: 0x1)
    FName BeforeMonsterEventID;                                                       // 0x00BC (size: 0x8)
    FName PreMonsterTalkID;                                                           // 0x00C4 (size: 0x8)
    FName LooseMonsterTalkID;                                                         // 0x00CC (size: 0x8)
    int32 AssassinateNeedLevel;                                                       // 0x00D4 (size: 0x4)
    FName DoseItemID;                                                                 // 0x00D8 (size: 0x8)
    int32 DoseItemNum;                                                                // 0x00E0 (size: 0x4)

}; // Size: 0xE8

struct FNPCBattleInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 BattleFlag;                                                                 // 0x000C (size: 0x4)
    int32 SubRelation;                                                                // 0x0010 (size: 0x4)
    TArray<FName> EnemyID;                                                            // 0x0018 (size: 0x10)
    TArray<int32> PositionID;                                                         // 0x0028 (size: 0x10)
    int32 NeedLevel;                                                                  // 0x0038 (size: 0x4)
    bool CanSwoon;                                                                    // 0x003C (size: 0x1)
    float SwoonOffsetPosX;                                                            // 0x0040 (size: 0x4)
    float SwoonOffsetPosY;                                                            // 0x0044 (size: 0x4)
    float SwoonOffsetPosZ;                                                            // 0x0048 (size: 0x4)
    TArray<bool> FlagList;                                                            // 0x0050 (size: 0x10)
    TArray<FString> NotBattleTalkList;                                                // 0x0060 (size: 0x10)
    int32 NotBattleBalloonType;                                                       // 0x0070 (size: 0x4)
    TArray<FString> ShortageLevelTalkList;                                            // 0x0078 (size: 0x10)
    int32 ShortageLevelBalloonType;                                                   // 0x0088 (size: 0x4)
    TArray<FString> PreBattleTalkList;                                                // 0x0090 (size: 0x10)
    int32 PreBattleBalloonType;                                                       // 0x00A0 (size: 0x4)
    TArray<FString> LoseTalkList;                                                     // 0x00A8 (size: 0x10)
    int32 LoseBalloonType;                                                            // 0x00B8 (size: 0x4)
    TArray<FString> WinTalkList;                                                      // 0x00C0 (size: 0x10)
    int32 WinBalloonType;                                                             // 0x00D0 (size: 0x4)
    TArray<FString> PreMonsterTalkList;                                               // 0x00D8 (size: 0x10)
    int32 PreMonsterBalloonType;                                                      // 0x00E8 (size: 0x4)
    TArray<FString> WinAMonsterTalkList;                                              // 0x00F0 (size: 0x10)
    int32 WinAMonsterBalloonType;                                                     // 0x0100 (size: 0x4)
    TArray<FString> SwoontTalkList;                                                   // 0x0108 (size: 0x10)
    int32 SwoontBalloonType;                                                          // 0x0118 (size: 0x4)
    bool IsSwoonPlayerTalk;                                                           // 0x011C (size: 0x1)
    int32 EventFlagIndex;                                                             // 0x0120 (size: 0x4)
    bool EventFlagSwitch;                                                             // 0x0124 (size: 0x1)

}; // Size: 0x128

struct FNPCCheckData : public FTableRowBase
{
    int32 LogicalType;                                                                // 0x0008 (size: 0x4)
    TArray<int32> FlagList;                                                           // 0x0010 (size: 0x10)
    TArray<bool> FlagEnableList;                                                      // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FNPCData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName TextLabel;                                                                  // 0x000C (size: 0x8)
    int32 NPC_UnqIndex;                                                               // 0x0014 (size: 0x4)
    FName ActionID;                                                                   // 0x0018 (size: 0x8)
    int32 FaintAction;                                                                // 0x0020 (size: 0x4)
    FString UsePathLabel;                                                             // 0x0028 (size: 0x10)
    bool IgnoreRelation;                                                              // 0x0038 (size: 0x1)
    FName WorseRelationTextLabel;                                                     // 0x003C (size: 0x8)
    FName FCmd_Purchase_ID;                                                           // 0x0044 (size: 0x8)
    FName FCmd_Lure_ID;                                                               // 0x004C (size: 0x8)
    FName FCmd_Battle_ID;                                                             // 0x0054 (size: 0x8)
    FName FCmd_Search_ID;                                                             // 0x005C (size: 0x8)
    int32 FCmd_RecoverArea;                                                           // 0x0064 (size: 0x4)
    FName FCmd_EnemyGroup;                                                            // 0x0068 (size: 0x8)
    int32 FCmd_UseBattleMapIndex;                                                     // 0x0070 (size: 0x4)
    FName TextInfoLabel;                                                              // 0x0074 (size: 0x8)
    bool IsNotWorsenRelation;                                                         // 0x007C (size: 0x1)
    EFieldCommandSpecialPopupType FcSpecialPopupType;                                 // 0x007D (size: 0x1)

}; // Size: 0x80

struct FNPCDiagramData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 VisibleLevel;                                                               // 0x000C (size: 0x4)
    int32 PlaceID;                                                                    // 0x0010 (size: 0x4)
    int32 NPCID;                                                                      // 0x0014 (size: 0x4)
    TArray<int32> TargetNPCID;                                                        // 0x0018 (size: 0x10)
    TArray<int32> RelationType;                                                       // 0x0028 (size: 0x10)
    TArray<int32> Detail;                                                             // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FNPCHearDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 CommandEnable;                                                              // 0x000C (size: 0x4)
    TArray<FName> HearInfoIDs;                                                        // 0x0010 (size: 0x10)
    int32 Age;                                                                        // 0x0020 (size: 0x4)
    FName HistoryTextID;                                                              // 0x0024 (size: 0x8)
    int32 HearNeedLevel;                                                              // 0x002C (size: 0x4)
    bool SpecialFlag;                                                                 // 0x0030 (size: 0x1)
    float SearchBaseProbability;                                                      // 0x0034 (size: 0x4)
    int32 SearchLockLevel;                                                            // 0x0038 (size: 0x4)
    FName SearchFailedTalkID;                                                         // 0x003C (size: 0x8)
    int32 BriberyBuyPrice;                                                            // 0x0044 (size: 0x4)
    FName RevealBeforeEventID;                                                        // 0x0048 (size: 0x8)
    FName RevealEnemyGroupID;                                                         // 0x0050 (size: 0x8)
    TArray<int32> RevealWinEventFlag;                                                 // 0x0058 (size: 0x10)
    TArray<int32> RevealLoseEventFlag;                                                // 0x0068 (size: 0x10)
    FName RevealSwapTargetPlacementLabel;                                             // 0x0078 (size: 0x8)
    bool SetHiddenAfterReveal;                                                        // 0x0080 (size: 0x1)
    FName SpecialHearDay_01;                                                          // 0x0084 (size: 0x8)
    FName SpecialHearDay_02;                                                          // 0x008C (size: 0x8)
    FName SpecialHearEvening_01;                                                      // 0x0094 (size: 0x8)
    FName SpecialHearEvening_02;                                                      // 0x009C (size: 0x8)

}; // Size: 0xA8

struct FNPCHearInfoDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ItemId;                                                                     // 0x000C (size: 0x8)
    int32 EventFlag;                                                                  // 0x0014 (size: 0x4)
    FName NotificationID;                                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FNPCInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 CharacterID;                                                                // 0x000C (size: 0x4)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    class UTexture2D* FaceIconTexture;                                                // 0x0020 (size: 0x8)
    int32 ActionID;                                                                   // 0x0028 (size: 0x4)
    int32 TownID;                                                                     // 0x002C (size: 0x4)
    bool IgnoreConnection;                                                            // 0x0030 (size: 0x1)
    TArray<FString> ConnectionTalkList;                                               // 0x0038 (size: 0x10)
    int32 ConnectionBalloonType;                                                      // 0x0048 (size: 0x4)
    int32 PurchaseID;                                                                 // 0x004C (size: 0x4)
    int32 BattleID;                                                                   // 0x0050 (size: 0x4)
    int32 SearchID;                                                                   // 0x0054 (size: 0x4)
    int32 LureID;                                                                     // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FNPCLeadDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 CommandEnable;                                                              // 0x000C (size: 0x4)
    FName SupporterID;                                                                // 0x0010 (size: 0x8)
    bool BanFastTravelInFollowing;                                                    // 0x0018 (size: 0x1)
    TArray<int32> UnFollowingFlags;                                                   // 0x0020 (size: 0x10)
    TArray<int32> FollowingFlags;                                                     // 0x0030 (size: 0x10)
    bool IgnoreFollowProcess;                                                         // 0x0040 (size: 0x1)
    bool StoryNpc;                                                                    // 0x0041 (size: 0x1)
    int32 LeadNeedLevel;                                                              // 0x0044 (size: 0x4)
    FName LeadSuccessTalkID;                                                          // 0x0048 (size: 0x8)
    FName LeadReleaseTalkID;                                                          // 0x0050 (size: 0x8)
    float LureBaseProbability;                                                        // 0x0058 (size: 0x4)
    FName LureSuccesTalkID;                                                           // 0x005C (size: 0x8)
    FName LureFailedTalkID;                                                           // 0x0064 (size: 0x8)
    FName LureReleaseTalkID;                                                          // 0x006C (size: 0x8)
    int32 HirePrice;                                                                  // 0x0074 (size: 0x4)
    FName HireSuccesTalkID;                                                           // 0x0078 (size: 0x8)
    FName HireReleaseTalkID;                                                          // 0x0080 (size: 0x8)
    TArray<FPlacateNeedItem> PlacateNeedItems;                                        // 0x0088 (size: 0x10)
    FName PlacateSuccesTalkID;                                                        // 0x0098 (size: 0x8)
    FName PlacateReleaseTalkID;                                                       // 0x00A0 (size: 0x8)
    FName SpActionMerchant;                                                           // 0x00A8 (size: 0x8)

}; // Size: 0xB0

struct FNPCLureInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 FollowFlag;                                                                 // 0x000C (size: 0x4)
    int32 LeadNeedLevel;                                                              // 0x0010 (size: 0x4)
    float LureBaseProbability;                                                        // 0x0014 (size: 0x4)
    int32 SubRelation;                                                                // 0x0018 (size: 0x4)
    TArray<FString> LeadSuccessTalkList;                                              // 0x0020 (size: 0x10)
    int32 LeadSuccessBalloonType;                                                     // 0x0030 (size: 0x4)
    TArray<FString> LeadReleaseTalkList;                                              // 0x0038 (size: 0x10)
    int32 LeadReleaseTalkBalloonType;                                                 // 0x0048 (size: 0x4)
    TArray<FString> SuccessTalkList;                                                  // 0x0050 (size: 0x10)
    int32 SuccessBalloonType;                                                         // 0x0060 (size: 0x4)
    TArray<FString> FailedTalkList;                                                   // 0x0068 (size: 0x10)
    int32 FailedTalkBalloonType;                                                      // 0x0078 (size: 0x4)
    TArray<FString> ReleaseTalkList;                                                  // 0x0080 (size: 0x10)
    int32 ReleaseTalkBalloonType;                                                     // 0x0090 (size: 0x4)
    FString BattleDataID;                                                             // 0x0098 (size: 0x10)

}; // Size: 0xA8

struct FNPCPersonalData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 VisibleLevel;                                                               // 0x000C (size: 0x4)
    int32 Sex;                                                                        // 0x0010 (size: 0x4)
    int32 Age;                                                                        // 0x0014 (size: 0x4)
    int32 CategoryTopName;                                                            // 0x0018 (size: 0x4)
    TArray<int32> CategoryTopDetailList;                                              // 0x0020 (size: 0x10)
    int32 CategoryBottomName;                                                         // 0x0030 (size: 0x4)
    TArray<int32> CategoryBottomDetailList;                                           // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FNPCPurchaseDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 CommandEnable;                                                              // 0x000C (size: 0x4)
    FName ShopID;                                                                     // 0x0010 (size: 0x8)
    FName PurchaseBuyTalkID;                                                          // 0x0018 (size: 0x8)
    FName StealSuccessTalkID;                                                         // 0x0020 (size: 0x8)
    FName StealFailedTalkID;                                                          // 0x0028 (size: 0x8)
    FName BegSuccessTalkID;                                                           // 0x0030 (size: 0x8)
    FName RobEnemyGroupID;                                                            // 0x0038 (size: 0x8)
    FName RobBeforeTalkID;                                                            // 0x0040 (size: 0x8)
    FName RobBeforeEventID;                                                           // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FNPCPurchaseInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<int32> PurchaseItemList;                                                   // 0x0010 (size: 0x10)
    int32 SubRelation;                                                                // 0x0020 (size: 0x4)
    TArray<FString> BuyTalkList;                                                      // 0x0028 (size: 0x10)
    int32 BuyBalloonType;                                                             // 0x0038 (size: 0x4)
    TArray<FString> StealSuccessTalkList;                                             // 0x0040 (size: 0x10)
    int32 StealSuccessBalloonType;                                                    // 0x0050 (size: 0x4)
    TArray<FString> StealFailedTalkList;                                              // 0x0058 (size: 0x10)
    int32 StealFailedBalloonType;                                                     // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FNPCSearchInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 InfoFlag;                                                                   // 0x000C (size: 0x4)
    int32 HearNeedLevel;                                                              // 0x0010 (size: 0x4)
    float SearchBase;                                                                 // 0x0014 (size: 0x4)
    int32 SubRelation;                                                                // 0x0018 (size: 0x4)
    int32 SearchLock;                                                                 // 0x001C (size: 0x4)
    TArray<int32> InfoDataList;                                                       // 0x0020 (size: 0x10)
    TArray<FString> SearchFailedTalkList;                                             // 0x0030 (size: 0x10)
    int32 SearchFailedBalloonType;                                                    // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FNPCSpawnData : public FTableRowBase
{
    TArray<FNPCSpawnEventFlag> EventFlag;                                             // 0x0008 (size: 0x10)
    bool CheckOR;                                                                     // 0x0018 (size: 0x1)
    bool IsDelete;                                                                    // 0x0019 (size: 0x1)
    FVector Offset;                                                                   // 0x001C (size: 0xC)
    int32 EventID;                                                                    // 0x0028 (size: 0x4)
    FName EventName;                                                                  // 0x002C (size: 0x8)

}; // Size: 0x38

struct FNPCSpawnEventFlag
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    bool Flag;                                                                        // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FNarrationDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName NarrationSet;                                                               // 0x000C (size: 0x8)
    bool HeightCentering;                                                             // 0x0014 (size: 0x1)
    bool ShowFrame;                                                                   // 0x0015 (size: 0x1)
    bool ShowBackground;                                                              // 0x0016 (size: 0x1)
    FName FlashbackLabel;                                                             // 0x0018 (size: 0x8)
    int32 FlashbackColor;                                                             // 0x0020 (size: 0x4)
    TArray<FNarrationTextGroup> TextGroup;                                            // 0x0028 (size: 0x10)
    float AutoNextTime;                                                               // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FNarrationTextGroup
{
    int32 GroupID;                                                                    // 0x0000 (size: 0x4)
    FName Text;                                                                       // 0x0004 (size: 0x8)
    int32 Justification;                                                              // 0x000C (size: 0x4)
    bool DisableFadeAnimation;                                                        // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FNextMapInfo
{
    FName MapName;                                                                    // 0x0000 (size: 0x8)
    ELevelTriggerID ReqTrigger;                                                       // 0x0008 (size: 0x1)
    int32 MapIndex;                                                                   // 0x000C (size: 0x4)
    bool UseFadeUI;                                                                   // 0x0010 (size: 0x1)
    ELEVEL_TYPE levelType;                                                            // 0x0011 (size: 0x1)
    bool ChangeBGM;                                                                   // 0x0012 (size: 0x1)
    bool IsSwichActive;                                                               // 0x0013 (size: 0x1)

}; // Size: 0x14

struct FNextPurposeData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName BelongMainStory;                                                            // 0x000C (size: 0x8)
    int32 ShowStartFlag;                                                              // 0x0014 (size: 0x4)
    int32 ShowEndFlag;                                                                // 0x0018 (size: 0x4)
    FName TextLabel;                                                                  // 0x001C (size: 0x8)
    bool ShowMessage;                                                                 // 0x0024 (size: 0x1)
    int32 ShowFlag;                                                                   // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FNoticeArgs
{
    int32 IntParam0;                                                                  // 0x0000 (size: 0x4)
    FName NameParam0;                                                                 // 0x0004 (size: 0x8)
    TArray<int32> IntParams;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FNoticeDelegateBP_Data
{
}; // Size: 0x10

struct FNpcEventData
{
    bool IsSwoon;                                                                     // 0x0000 (size: 0x1)
    ENpcSwoonType SwoonType;                                                          // 0x0001 (size: 0x1)
    TArray<bool> IsPurchasedItem;                                                     // 0x0008 (size: 0x10)
    int32 PurchaseRestock;                                                            // 0x0018 (size: 0x4)
    bool HearFlag;                                                                    // 0x001C (size: 0x1)
    ETimeZoneType SwoonTimeZone;                                                      // 0x001D (size: 0x1)

}; // Size: 0x20

struct FObjectVisibilityData
{
}; // Size: 0x20

struct FOnClosedPartySplitParam
{
    TMap<class EPlayableCharacterID, class EPARTY_SPLIT_PLACEMENT_POSITION> PlacementResult; // 0x0000 (size: 0x50)
    EPARTY_SPLIT_CLOSE_REASON CloseReason;                                            // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FOptionGroupData : public FTableRowBase
{
    FName GroupTitle;                                                                 // 0x0008 (size: 0x8)
    TArray<FOptionItemData> ItemData;                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FOptionItemData : public FTableRowBase
{
    EOPTION_ITEM_KIND OptionKind;                                                     // 0x0008 (size: 0x1)
    bool OnlyPC;                                                                      // 0x0009 (size: 0x1)
    FName ItemText1;                                                                  // 0x000C (size: 0x8)
    FName ItemText2;                                                                  // 0x0014 (size: 0x8)
    FName DescriptionText;                                                            // 0x001C (size: 0x8)
    EOPTION_WIDGET_KIND WidgetKind;                                                   // 0x0024 (size: 0x1)
    int32 DefaultValue;                                                               // 0x0028 (size: 0x4)
    FName Icon;                                                                       // 0x002C (size: 0x8)
    TArray<FName> ItemTextList;                                                       // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FOptionItemLabelSet : public FTableRowBase
{
    FName ItemText1;                                                                  // 0x0008 (size: 0x8)
    FName ItemText2;                                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FOptionalParts
{
    class UStaticMesh* m_cOptionalParts;                                              // 0x0000 (size: 0x8)
    class UStaticMesh* m_cOptionalPartsLeft;                                          // 0x0008 (size: 0x8)
    class UStaticMesh* m_cOptionalPartsRight;                                         // 0x0010 (size: 0x8)
    FVector m_vPosition;                                                              // 0x0018 (size: 0xC)
    bool m_bIsSnapGrid;                                                               // 0x0024 (size: 0x1)
    FVector m_vOffset;                                                                // 0x0028 (size: 0xC)
    FRotator m_qRotate;                                                               // 0x0034 (size: 0xC)
    bool m_bIsPatternX;                                                               // 0x0040 (size: 0x1)
    bool m_bIsPatternY;                                                               // 0x0041 (size: 0x1)
    bool m_bIsPatternAround;                                                          // 0x0042 (size: 0x1)
    bool m_bIsPatternBack;                                                            // 0x0043 (size: 0x1)
    FVector m_vInterval;                                                              // 0x0044 (size: 0xC)
    bool m_bIsOverlapPost;                                                            // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FPS5VibrationData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    class USoundWave* VibrationAsset;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPartyChat : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName EventLabel;                                                                 // 0x000C (size: 0x8)
    EPARTY_CHAT_TYPE PartyChatType;                                                   // 0x0014 (size: 0x1)
    FName MainStoryTaskBegin;                                                         // 0x0018 (size: 0x8)
    FName MainStoryTaskEnd;                                                           // 0x0020 (size: 0x8)
    TArray<FName> OccurLevelLabels;                                                   // 0x0028 (size: 0x10)
    FName TitleTextLabel;                                                             // 0x0038 (size: 0x8)
    FName RelatedMainStory;                                                           // 0x0040 (size: 0x8)
    TArray<EPlayableCharacterID> RequiredCharacter;                                   // 0x0048 (size: 0x10)
    bool IgnoreRequiredCharacter;                                                     // 0x0058 (size: 0x1)
    int32 NeedLevelChangeCount;                                                       // 0x005C (size: 0x4)
    int32 BurnTorchCountLimit;                                                        // 0x0060 (size: 0x4)
    bool IsIgnoreFixedPartyMode;                                                      // 0x0064 (size: 0x1)

}; // Size: 0x68

struct FPartyChatSaveData
{
    int32 PartyChatFlg;                                                               // 0x0000 (size: 0x4)
    int32 State;                                                                      // 0x0004 (size: 0x4)
    bool Flag;                                                                        // 0x0008 (size: 0x1)
    int32 PlayedTimeZone;                                                             // 0x000C (size: 0x4)
    int32 PlayedLevelId;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPartyFollowData
{
}; // Size: 0x94

struct FPlacateNeedItem
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    int32 ItemNum;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPlacementData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    uint8 PlacementType;                                                              // 0x000C (size: 0x1)
    int32 MainScenarioType;                                                           // 0x0010 (size: 0x4)
    int32 MainScenarioID;                                                             // 0x0014 (size: 0x4)
    FName ResourceLabel;                                                              // 0x0018 (size: 0x8)
    bool InvalidRadarIcon;                                                            // 0x0020 (size: 0x1)
    bool IgnoreGravity;                                                               // 0x0021 (size: 0x1)
    bool IndoorFlag;                                                                  // 0x0022 (size: 0x1)
    int32 HouseInFloor;                                                               // 0x0024 (size: 0x4)
    float TriggerScaleX;                                                              // 0x0028 (size: 0x4)
    float TriggerScaleY;                                                              // 0x002C (size: 0x4)
    float TriggerScaleZ;                                                              // 0x0030 (size: 0x4)
    int32 SpawnStartFlag;                                                             // 0x0034 (size: 0x4)
    int32 SpawnEndFlag;                                                               // 0x0038 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneSpawnType;                                         // 0x003C (size: 0x1)
    int32 SpawnStartDelayCount;                                                       // 0x0040 (size: 0x4)
    int32 SpawnEndDelayCount;                                                         // 0x0044 (size: 0x4)
    EPlayableCharacterID CompProloguePlayerID;                                        // 0x0048 (size: 0x1)
    bool NorSpawnPrologue;                                                            // 0x0049 (size: 0x1)
    bool NotSpawnFinal;                                                               // 0x004A (size: 0x1)
    TArray<FName> NotCoexistencePlacementLabel;                                       // 0x0050 (size: 0x10)
    FString SpawnDir;                                                                 // 0x0060 (size: 0x10)
    float SpawnPosX;                                                                  // 0x0070 (size: 0x4)
    float SpawnPosY;                                                                  // 0x0074 (size: 0x4)
    float SpawnPosZ;                                                                  // 0x0078 (size: 0x4)
    float FaintSpawnPosX;                                                             // 0x007C (size: 0x4)
    float FaintSpawnPosY;                                                             // 0x0080 (size: 0x4)
    float FaintSpawnPosZ;                                                             // 0x0084 (size: 0x4)
    float EmotionOffsetX;                                                             // 0x0088 (size: 0x4)
    float EmotionOffsetY;                                                             // 0x008C (size: 0x4)
    float EmotionOffsetZ;                                                             // 0x0090 (size: 0x4)
    FName CaptionTextLabel;                                                           // 0x0094 (size: 0x8)
    uint8 SinglePlayMotion;                                                           // 0x009C (size: 0x1)
    FString Emotion;                                                                  // 0x00A0 (size: 0x10)
    uint8 Permission_FCmd;                                                            // 0x00B0 (size: 0x1)
    int32 AllowBanFlag_FCmd;                                                          // 0x00B4 (size: 0x4)
    bool FixDirInFieldCommand;                                                        // 0x00B8 (size: 0x1)
    FString EventType_A;                                                              // 0x00C0 (size: 0x10)
    int32 EventStartFlag_A;                                                           // 0x00D0 (size: 0x4)
    int32 EventEndFlag_A;                                                             // 0x00D4 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_A;                                     // 0x00D8 (size: 0x1)
    FName EventParam_A_1_ID;                                                          // 0x00DC (size: 0x8)
    FName EventParam_A_1;                                                             // 0x00E4 (size: 0x8)
    FName EventParam_A_2_ID;                                                          // 0x00EC (size: 0x8)
    FName EventParam_A_2;                                                             // 0x00F4 (size: 0x8)
    FName EventParam_A_3_ID;                                                          // 0x00FC (size: 0x8)
    FName EventParam_A_3;                                                             // 0x0104 (size: 0x8)
    FName EventParam_A_4_ID;                                                          // 0x010C (size: 0x8)
    FName EventParam_A_4;                                                             // 0x0114 (size: 0x8)
    FName EventParam_A_5_ID;                                                          // 0x011C (size: 0x8)
    FName EventParam_A_5;                                                             // 0x0124 (size: 0x8)
    FName EventParam_A_6_ID;                                                          // 0x012C (size: 0x8)
    FName EventParam_A_6;                                                             // 0x0134 (size: 0x8)
    FName EventParam_A_7_ID;                                                          // 0x013C (size: 0x8)
    FName EventParam_A_7;                                                             // 0x0144 (size: 0x8)
    FName EventParam_A_8_ID;                                                          // 0x014C (size: 0x8)
    FName EventParam_A_8;                                                             // 0x0154 (size: 0x8)
    FName EventParam_A_9_ID;                                                          // 0x015C (size: 0x8)
    FName EventParam_A_9;                                                             // 0x0164 (size: 0x8)
    FName EventParam_A_10_ID;                                                         // 0x016C (size: 0x8)
    FName EventParam_A_10;                                                            // 0x0174 (size: 0x8)
    FName EventLabel_A;                                                               // 0x017C (size: 0x8)
    FString EventType_B;                                                              // 0x0188 (size: 0x10)
    int32 EventStartFlag_B;                                                           // 0x0198 (size: 0x4)
    int32 EventEndFlag_B;                                                             // 0x019C (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_B;                                     // 0x01A0 (size: 0x1)
    FName EventParam_B_1_ID;                                                          // 0x01A4 (size: 0x8)
    FName EventParam_B_1;                                                             // 0x01AC (size: 0x8)
    FName EventParam_B_2_ID;                                                          // 0x01B4 (size: 0x8)
    FName EventParam_B_2;                                                             // 0x01BC (size: 0x8)
    FName EventParam_B_3_ID;                                                          // 0x01C4 (size: 0x8)
    FName EventParam_B_3;                                                             // 0x01CC (size: 0x8)
    FName EventParam_B_4_ID;                                                          // 0x01D4 (size: 0x8)
    FName EventParam_B_4;                                                             // 0x01DC (size: 0x8)
    FName EventParam_B_5_ID;                                                          // 0x01E4 (size: 0x8)
    FName EventParam_B_5;                                                             // 0x01EC (size: 0x8)
    FName EventParam_B_6_ID;                                                          // 0x01F4 (size: 0x8)
    FName EventParam_B_6;                                                             // 0x01FC (size: 0x8)
    FName EventParam_B_7_ID;                                                          // 0x0204 (size: 0x8)
    FName EventParam_B_7;                                                             // 0x020C (size: 0x8)
    FName EventParam_B_8_ID;                                                          // 0x0214 (size: 0x8)
    FName EventParam_B_8;                                                             // 0x021C (size: 0x8)
    FName EventParam_B_9_ID;                                                          // 0x0224 (size: 0x8)
    FName EventParam_B_9;                                                             // 0x022C (size: 0x8)
    FName EventParam_B_10_ID;                                                         // 0x0234 (size: 0x8)
    FName EventParam_B_10;                                                            // 0x023C (size: 0x8)
    FName EventLabel_B;                                                               // 0x0244 (size: 0x8)
    FString EventType_C;                                                              // 0x0250 (size: 0x10)
    int32 EventStartFlag_C;                                                           // 0x0260 (size: 0x4)
    int32 EventEndFlag_C;                                                             // 0x0264 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_C;                                     // 0x0268 (size: 0x1)
    FName EventParam_C_1_ID;                                                          // 0x026C (size: 0x8)
    FName EventParam_C_1;                                                             // 0x0274 (size: 0x8)
    FName EventParam_C_2_ID;                                                          // 0x027C (size: 0x8)
    FName EventParam_C_2;                                                             // 0x0284 (size: 0x8)
    FName EventParam_C_3_ID;                                                          // 0x028C (size: 0x8)
    FName EventParam_C_3;                                                             // 0x0294 (size: 0x8)
    FName EventParam_C_4_ID;                                                          // 0x029C (size: 0x8)
    FName EventParam_C_4;                                                             // 0x02A4 (size: 0x8)
    FName EventParam_C_5_ID;                                                          // 0x02AC (size: 0x8)
    FName EventParam_C_5;                                                             // 0x02B4 (size: 0x8)
    FName EventParam_C_6_ID;                                                          // 0x02BC (size: 0x8)
    FName EventParam_C_6;                                                             // 0x02C4 (size: 0x8)
    FName EventParam_C_7_ID;                                                          // 0x02CC (size: 0x8)
    FName EventParam_C_7;                                                             // 0x02D4 (size: 0x8)
    FName EventParam_C_8_ID;                                                          // 0x02DC (size: 0x8)
    FName EventParam_C_8;                                                             // 0x02E4 (size: 0x8)
    FName EventParam_C_9_ID;                                                          // 0x02EC (size: 0x8)
    FName EventParam_C_9;                                                             // 0x02F4 (size: 0x8)
    FName EventParam_C_10_ID;                                                         // 0x02FC (size: 0x8)
    FName EventParam_C_10;                                                            // 0x0304 (size: 0x8)
    FName EventLabel_C;                                                               // 0x030C (size: 0x8)
    FString EventType_D;                                                              // 0x0318 (size: 0x10)
    int32 EventStartFlag_D;                                                           // 0x0328 (size: 0x4)
    int32 EventEndFlag_D;                                                             // 0x032C (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_D;                                     // 0x0330 (size: 0x1)
    FName EventParam_D_1_ID;                                                          // 0x0334 (size: 0x8)
    FName EventParam_D_1;                                                             // 0x033C (size: 0x8)
    FName EventParam_D_2_ID;                                                          // 0x0344 (size: 0x8)
    FName EventParam_D_2;                                                             // 0x034C (size: 0x8)
    FName EventParam_D_3_ID;                                                          // 0x0354 (size: 0x8)
    FName EventParam_D_3;                                                             // 0x035C (size: 0x8)
    FName EventParam_D_4_ID;                                                          // 0x0364 (size: 0x8)
    FName EventParam_D_4;                                                             // 0x036C (size: 0x8)
    FName EventParam_D_5_ID;                                                          // 0x0374 (size: 0x8)
    FName EventParam_D_5;                                                             // 0x037C (size: 0x8)
    FName EventParam_D_6_ID;                                                          // 0x0384 (size: 0x8)
    FName EventParam_D_6;                                                             // 0x038C (size: 0x8)
    FName EventParam_D_7_ID;                                                          // 0x0394 (size: 0x8)
    FName EventParam_D_7;                                                             // 0x039C (size: 0x8)
    FName EventParam_D_8_ID;                                                          // 0x03A4 (size: 0x8)
    FName EventParam_D_8;                                                             // 0x03AC (size: 0x8)
    FName EventParam_D_9_ID;                                                          // 0x03B4 (size: 0x8)
    FName EventParam_D_9;                                                             // 0x03BC (size: 0x8)
    FName EventParam_D_10_ID;                                                         // 0x03C4 (size: 0x8)
    FName EventParam_D_10;                                                            // 0x03CC (size: 0x8)
    FName EventLabel_D;                                                               // 0x03D4 (size: 0x8)
    FString EventType_E;                                                              // 0x03E0 (size: 0x10)
    int32 EventStartFlag_E;                                                           // 0x03F0 (size: 0x4)
    int32 EventEndFlag_E;                                                             // 0x03F4 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_E;                                     // 0x03F8 (size: 0x1)
    FName EventParam_E_1_ID;                                                          // 0x03FC (size: 0x8)
    FName EventParam_E_1;                                                             // 0x0404 (size: 0x8)
    FName EventParam_E_2_ID;                                                          // 0x040C (size: 0x8)
    FName EventParam_E_2;                                                             // 0x0414 (size: 0x8)
    FName EventParam_E_3_ID;                                                          // 0x041C (size: 0x8)
    FName EventParam_E_3;                                                             // 0x0424 (size: 0x8)
    FName EventParam_E_4_ID;                                                          // 0x042C (size: 0x8)
    FName EventParam_E_4;                                                             // 0x0434 (size: 0x8)
    FName EventParam_E_5_ID;                                                          // 0x043C (size: 0x8)
    FName EventParam_E_5;                                                             // 0x0444 (size: 0x8)
    FName EventParam_E_6_ID;                                                          // 0x044C (size: 0x8)
    FName EventParam_E_6;                                                             // 0x0454 (size: 0x8)
    FName EventParam_E_7_ID;                                                          // 0x045C (size: 0x8)
    FName EventParam_E_7;                                                             // 0x0464 (size: 0x8)
    FName EventParam_E_8_ID;                                                          // 0x046C (size: 0x8)
    FName EventParam_E_8;                                                             // 0x0474 (size: 0x8)
    FName EventParam_E_9_ID;                                                          // 0x047C (size: 0x8)
    FName EventParam_E_9;                                                             // 0x0484 (size: 0x8)
    FName EventParam_E_10_ID;                                                         // 0x048C (size: 0x8)
    FName EventParam_E_10;                                                            // 0x0494 (size: 0x8)
    FName EventLabel_E;                                                               // 0x049C (size: 0x8)
    FString EventType_F;                                                              // 0x04A8 (size: 0x10)
    int32 EventStartFlag_F;                                                           // 0x04B8 (size: 0x4)
    int32 EventEndFlag_F;                                                             // 0x04BC (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_F;                                     // 0x04C0 (size: 0x1)
    FName EventParam_F_1;                                                             // 0x04C4 (size: 0x8)
    FName EventParam_F_2;                                                             // 0x04CC (size: 0x8)
    FName EventParam_F_3;                                                             // 0x04D4 (size: 0x8)
    FName EventParam_F_4;                                                             // 0x04DC (size: 0x8)
    FName EventParam_F_5;                                                             // 0x04E4 (size: 0x8)
    FName EventParam_F_6;                                                             // 0x04EC (size: 0x8)
    FName EventParam_F_7;                                                             // 0x04F4 (size: 0x8)
    FName EventParam_F_8;                                                             // 0x04FC (size: 0x8)
    FName EventParam_F_9;                                                             // 0x0504 (size: 0x8)
    FName EventParam_F_10;                                                            // 0x050C (size: 0x8)
    FName EventLabel_F;                                                               // 0x0514 (size: 0x8)
    FString EventType_G;                                                              // 0x0520 (size: 0x10)
    int32 EventStartFlag_G;                                                           // 0x0530 (size: 0x4)
    int32 EventEndFlag_G;                                                             // 0x0534 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_G;                                     // 0x0538 (size: 0x1)
    FName EventParam_G_1;                                                             // 0x053C (size: 0x8)
    FName EventParam_G_2;                                                             // 0x0544 (size: 0x8)
    FName EventParam_G_3;                                                             // 0x054C (size: 0x8)
    FName EventParam_G_4;                                                             // 0x0554 (size: 0x8)
    FName EventParam_G_5;                                                             // 0x055C (size: 0x8)
    FName EventParam_G_6;                                                             // 0x0564 (size: 0x8)
    FName EventParam_G_7;                                                             // 0x056C (size: 0x8)
    FName EventParam_G_8;                                                             // 0x0574 (size: 0x8)
    FName EventParam_G_9;                                                             // 0x057C (size: 0x8)
    FName EventParam_G_10;                                                            // 0x0584 (size: 0x8)
    FName EventLabel_G;                                                               // 0x058C (size: 0x8)
    FString EventType_H;                                                              // 0x0598 (size: 0x10)
    int32 EventStartFlag_H;                                                           // 0x05A8 (size: 0x4)
    int32 EventEndFlag_H;                                                             // 0x05AC (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_H;                                     // 0x05B0 (size: 0x1)
    FName EventParam_H_1;                                                             // 0x05B4 (size: 0x8)
    FName EventParam_H_2;                                                             // 0x05BC (size: 0x8)
    FName EventParam_H_3;                                                             // 0x05C4 (size: 0x8)
    FName EventParam_H_4;                                                             // 0x05CC (size: 0x8)
    FName EventParam_H_5;                                                             // 0x05D4 (size: 0x8)
    FName EventParam_H_6;                                                             // 0x05DC (size: 0x8)
    FName EventParam_H_7;                                                             // 0x05E4 (size: 0x8)
    FName EventParam_H_8;                                                             // 0x05EC (size: 0x8)
    FName EventParam_H_9;                                                             // 0x05F4 (size: 0x8)
    FName EventParam_H_10;                                                            // 0x05FC (size: 0x8)
    FName EventLabel_H;                                                               // 0x0604 (size: 0x8)
    FString EventType_I;                                                              // 0x0610 (size: 0x10)
    int32 EventStartFlag_I;                                                           // 0x0620 (size: 0x4)
    int32 EventEndFlag_I;                                                             // 0x0624 (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_I;                                     // 0x0628 (size: 0x1)
    FName EventParam_I_1;                                                             // 0x062C (size: 0x8)
    FName EventParam_I_2;                                                             // 0x0634 (size: 0x8)
    FName EventParam_I_3;                                                             // 0x063C (size: 0x8)
    FName EventParam_I_4;                                                             // 0x0644 (size: 0x8)
    FName EventParam_I_5;                                                             // 0x064C (size: 0x8)
    FName EventParam_I_6;                                                             // 0x0654 (size: 0x8)
    FName EventParam_I_7;                                                             // 0x065C (size: 0x8)
    FName EventParam_I_8;                                                             // 0x0664 (size: 0x8)
    FName EventParam_I_9;                                                             // 0x066C (size: 0x8)
    FName EventParam_I_10;                                                            // 0x0674 (size: 0x8)
    FName EventLabel_I;                                                               // 0x067C (size: 0x8)
    FString EventType_J;                                                              // 0x0688 (size: 0x10)
    int32 EventStartFlag_J;                                                           // 0x0698 (size: 0x4)
    int32 EventEndFlag_J;                                                             // 0x069C (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType_J;                                     // 0x06A0 (size: 0x1)
    FName EventParam_J_1;                                                             // 0x06A4 (size: 0x8)
    FName EventParam_J_2;                                                             // 0x06AC (size: 0x8)
    FName EventParam_J_3;                                                             // 0x06B4 (size: 0x8)
    FName EventParam_J_4;                                                             // 0x06BC (size: 0x8)
    FName EventParam_J_5;                                                             // 0x06C4 (size: 0x8)
    FName EventParam_J_6;                                                             // 0x06CC (size: 0x8)
    FName EventParam_J_7;                                                             // 0x06D4 (size: 0x8)
    FName EventParam_J_8;                                                             // 0x06DC (size: 0x8)
    FName EventParam_J_9;                                                             // 0x06E4 (size: 0x8)
    FName EventParam_J_10;                                                            // 0x06EC (size: 0x8)
    FName EventLabel_J;                                                               // 0x06F4 (size: 0x8)

}; // Size: 0x700

struct FPlacementEventParamSet
{
    int32 ParamSetIndex;                                                              // 0x0000 (size: 0x4)
    FString EventType;                                                                // 0x0008 (size: 0x10)
    int32 EventStartFlag;                                                             // 0x0018 (size: 0x4)
    int32 EventEndFlag;                                                               // 0x001C (size: 0x4)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTriggerType;                                       // 0x0020 (size: 0x1)
    FName EventParam_1;                                                               // 0x0024 (size: 0x8)
    FName EventParam_2;                                                               // 0x002C (size: 0x8)
    FName EventParam_3;                                                               // 0x0034 (size: 0x8)
    FName EventParam_4;                                                               // 0x003C (size: 0x8)
    FName EventParam_5;                                                               // 0x0044 (size: 0x8)
    FName EventParam_6;                                                               // 0x004C (size: 0x8)
    FName EventParam_7;                                                               // 0x0054 (size: 0x8)
    FName EventParam_8;                                                               // 0x005C (size: 0x8)
    FName EventParam_9;                                                               // 0x0064 (size: 0x8)
    FName EventParam_10;                                                              // 0x006C (size: 0x8)
    FName EventLabel;                                                                 // 0x0074 (size: 0x8)

}; // Size: 0x80

struct FPlacementLabelInfo : public FTableRowBase
{
    TArray<FName> PlaceLabelArray;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPlantResourceData
{
    class UStaticMesh* m_Mesh;                                                        // 0x0000 (size: 0x8)
    int32 m_Ratio;                                                                    // 0x0008 (size: 0x4)
    int32 m_GenerateNum;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPlayAction
{
    EKSCharacterAction ActionID;                                                      // 0x0000 (size: 0x1)
    int32 StartFrame;                                                                 // 0x0004 (size: 0x4)
    bool Force;                                                                       // 0x0008 (size: 0x1)
    EKSCharacterAnimationLoop ManualLoop;                                             // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FPlayRequest
{
    int32 PlayIndex;                                                                  // 0x0000 (size: 0x4)
    FName Label;                                                                      // 0x0004 (size: 0x8)
    bool Loop;                                                                        // 0x000C (size: 0x1)
    int32 LoopInterval;                                                               // 0x0010 (size: 0x4)
    float Power;                                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPlayableCharacterData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName DisplayName;                                                                // 0x000C (size: 0x8)
    ECharacterRole CharacterRole;                                                     // 0x0014 (size: 0x1)
    TArray<FName> ResourceLabel;                                                      // 0x0018 (size: 0x10)
    FName GuestResourceLabel;                                                         // 0x0028 (size: 0x8)
    TArray<FName> VoiceCueSheet_ja;                                                   // 0x0030 (size: 0x10)
    TArray<FName> VoiceCueSheet_en;                                                   // 0x0040 (size: 0x10)
    FName VoiceSet;                                                                   // 0x0050 (size: 0x8)
    TArray<ESpecialActionType> SpecialActionList;                                     // 0x0058 (size: 0x10)
    FName PotentialityActionLabel;                                                    // 0x0068 (size: 0x8)
    FName SecondPotentialityActionLabel;                                              // 0x0070 (size: 0x8)
    int32 SecondPotentialityActionFlag;                                               // 0x0078 (size: 0x4)
    EBATTLE_STYLE_TYPE UniqueStyle;                                                   // 0x007C (size: 0x1)
    int32 ReleaseStyleFlag;                                                           // 0x0080 (size: 0x4)
    int32 StyleAvailableCount;                                                        // 0x0084 (size: 0x4)
    int32 InitLevel;                                                                  // 0x0088 (size: 0x4)
    FCharacterParam ParameterRevision;                                                // 0x008C (size: 0x34)
    EWEAPON_STANCE WeaponStance;                                                      // 0x00C0 (size: 0x1)
    EWEAPON_CATEGORY MainWeapon;                                                      // 0x00C1 (size: 0x1)
    FSaveEquipmentData FirstEquipment;                                                // 0x00C8 (size: 0x60)
    EJOB_TYPE FirstJob;                                                               // 0x0128 (size: 0x1)
    FFieldCommandInfo FieldCommandInfo;                                               // 0x0130 (size: 0x18)
    int32 MainMissionPlayingFlag;                                                     // 0x0148 (size: 0x4)
    FName SymbolLabel;                                                                // 0x014C (size: 0x8)
    FName SymbolWhLabel;                                                              // 0x0154 (size: 0x8)
    FName DayPortraitLabel;                                                           // 0x015C (size: 0x8)
    FName DayPortraitBgLabel;                                                         // 0x0164 (size: 0x8)
    FName NightPortraitLabel;                                                         // 0x016C (size: 0x8)
    FName NightPortraitBgLabel;                                                       // 0x0174 (size: 0x8)
    FName PortraitNameLabel;                                                          // 0x017C (size: 0x8)
    TArray<FAdvancedAbility> AdvancedAbility;                                         // 0x0188 (size: 0x10)
    FName TextInfoLabel;                                                              // 0x0198 (size: 0x8)
    TArray<FCharacterCostumeInfo> CostumeList;                                        // 0x01A0 (size: 0x10)
    FName CharmEnemyLabel;                                                            // 0x01B0 (size: 0x8)

}; // Size: 0x1B8

struct FPlayerBackpack
{
    int32 Money;                                                                      // 0x0000 (size: 0x4)
    TArray<FSaveBackPackItem> ItemList;                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPlayerLocation
{
    FName levelName;                                                                  // 0x0000 (size: 0x8)
    FVector Position;                                                                 // 0x0008 (size: 0xC)
    int32 levelId;                                                                    // 0x0014 (size: 0x4)
    uint8 RecentLevelTriggerId;                                                       // 0x0018 (size: 0x1)
    EKSCharacterDir Dir;                                                              // 0x0019 (size: 0x1)

}; // Size: 0x1C

struct FPlayerMoveHistory
{
    FVector vLocation;                                                                // 0x0000 (size: 0xC)
    uint8 nDir;                                                                       // 0x000C (size: 0x1)
    EKSCharacterMoveMode eMoveMode;                                                   // 0x0016 (size: 0x1)

}; // Size: 0x18

struct FPlayerParty
{
    TArray<int32> MainMemberID;                                                       // 0x0000 (size: 0x10)
    TArray<int32> SubMemberID;                                                        // 0x0010 (size: 0x10)
    FVector CameraLockPos;                                                            // 0x0020 (size: 0xC)
    int32 LastBgmID;                                                                  // 0x002C (size: 0x4)
    int32 levelId;                                                                    // 0x0030 (size: 0x4)
    FVector Position;                                                                 // 0x0034 (size: 0xC)
    uint8 Dir;                                                                        // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FPlayerVoiceList : public FTableRowBase
{
    TArray<FName> VoiceLabel;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPlayerVoiceSet : public FTableRowBase
{
    TArray<FPlayerVoiceList> VoiceList;                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPotentialityActionData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 ReleaseFlag;                                                                // 0x000C (size: 0x4)
    FName NameTextInMenu;                                                             // 0x0010 (size: 0x8)
    FName DetailTextInMenu;                                                           // 0x0018 (size: 0x8)
    FName NameTextinBattle;                                                           // 0x0020 (size: 0x8)
    FName DetailTextInBattle;                                                         // 0x0028 (size: 0x8)
    FName DetailTextInPlayerSelect;                                                   // 0x0030 (size: 0x8)
    EPOTENTIALITY_ACTION_TYPE ActionType;                                             // 0x0038 (size: 0x1)
    int32 ActionPointInit;                                                            // 0x003C (size: 0x4)
    int32 ActionPointMax;                                                             // 0x0040 (size: 0x4)
    TArray<FName> AddAbilityList;                                                     // 0x0048 (size: 0x10)
    FLinearColor EffectColor;                                                         // 0x0058 (size: 0x10)
    FName GageIconLabel;                                                              // 0x0068 (size: 0x8)
    FName GageEffectTexLabel;                                                         // 0x0070 (size: 0x8)
    FName AuraEffectLabel;                                                            // 0x0078 (size: 0x8)

}; // Size: 0x80

struct FPreparationData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 PreparationID;                                                              // 0x000C (size: 0x4)
    FName DisplayName;                                                                // 0x0010 (size: 0x8)
    FName BuildUpDisplayName;                                                         // 0x0018 (size: 0x8)
    FName Detail;                                                                     // 0x0020 (size: 0x8)
    FName Material;                                                                   // 0x0028 (size: 0x8)
    EATTRIBUTE_TYPE Attribute;                                                        // 0x0030 (size: 0x1)
    int32 BaseCount;                                                                  // 0x0034 (size: 0x4)
    EBATTLE_ACTION_ORDER_ESTIMATE_TYPE EstimateOrderType;                             // 0x0038 (size: 0x1)
    EBATTLE_ACTION_ORDER_ESTIMATE_TYPE BuildUpEstimateOrderType;                      // 0x0039 (size: 0x1)
    int32 EstimateOrderCount;                                                         // 0x003C (size: 0x4)
    TArray<FAilmentHandler> Ailment;                                                  // 0x0040 (size: 0x10)
    TArray<FAilmentHandler> BuildUpAilment;                                           // 0x0050 (size: 0x10)
    TSoftObjectPtr<ULevelSequence> ActionCommandSequencer;                            // 0x0060 (size: 0x28)
    TSoftObjectPtr<ULevelSequence> BuildUpSequencer;                                  // 0x0088 (size: 0x28)
    bool IsBuildUp;                                                                   // 0x00B0 (size: 0x1)
    bool IsSpread;                                                                    // 0x00B1 (size: 0x1)
    bool IsRandom;                                                                    // 0x00B2 (size: 0x1)
    TArray<FName> AbilitySE;                                                          // 0x00B8 (size: 0x10)
    ETIMEZONE_TRIGGER_TYPE TimeZoneTrigger;                                           // 0x00C8 (size: 0x1)

}; // Size: 0xD0

struct FProceduralBuildingMeshDataSet
{
    class UStaticMesh* m_cGroundPost;                                                 // 0x0000 (size: 0x8)
    class UStaticMesh* m_cGroundLoopX;                                                // 0x0008 (size: 0x8)
    class UStaticMesh* m_cGroundLoopY;                                                // 0x0010 (size: 0x8)
    class UStaticMesh* m_cWallPost;                                                   // 0x0018 (size: 0x8)
    class UStaticMesh* m_cWallLoopX;                                                  // 0x0020 (size: 0x8)
    class UStaticMesh* m_cWallLoopY;                                                  // 0x0028 (size: 0x8)
    class UStaticMesh* m_cRoofEdgeStart;                                              // 0x0030 (size: 0x8)
    class UStaticMesh* m_cRoofEdgeLoop;                                               // 0x0038 (size: 0x8)
    class UStaticMesh* m_cRoofEdgeLoop2;                                              // 0x0040 (size: 0x8)
    class UStaticMesh* m_cRoofEdgeEnd;                                                // 0x0048 (size: 0x8)
    class UStaticMesh* m_cRoofCenterStart;                                            // 0x0050 (size: 0x8)
    class UStaticMesh* m_cRoofCenterLoop;                                             // 0x0058 (size: 0x8)
    class UStaticMesh* m_cRoofCenterLoop2;                                            // 0x0060 (size: 0x8)
    class UStaticMesh* m_cRoofCenterEnd;                                              // 0x0068 (size: 0x8)
    class UStaticMesh* m_cRoofTopEventStart;                                          // 0x0070 (size: 0x8)
    class UStaticMesh* m_cRoofTopEventLoop;                                           // 0x0078 (size: 0x8)
    class UStaticMesh* m_cRoofTopEventLoop2;                                          // 0x0080 (size: 0x8)
    class UStaticMesh* m_cRoofTopEventEnd;                                            // 0x0088 (size: 0x8)
    class UStaticMesh* m_cRoofTopOddStart;                                            // 0x0090 (size: 0x8)
    class UStaticMesh* m_cRoofTopOddLoop;                                             // 0x0098 (size: 0x8)
    class UStaticMesh* m_cRoofTopOddLoop2;                                            // 0x00A0 (size: 0x8)
    class UStaticMesh* m_cRoofTopOddEnd;                                              // 0x00A8 (size: 0x8)
    class UStaticMesh* m_cRoofSideLeft;                                               // 0x00B0 (size: 0x8)
    class UStaticMesh* m_cRoofSideLoop;                                               // 0x00B8 (size: 0x8)
    class UStaticMesh* m_cRoofSideRight;                                              // 0x00C0 (size: 0x8)
    class UStaticMesh* m_cRoofSidePost;                                               // 0x00C8 (size: 0x8)
    class UStaticMesh* m_cRoofSideTop;                                                // 0x00D0 (size: 0x8)
    class UStaticMesh* m_cRoofSideLoopRight;                                          // 0x00D8 (size: 0x8)
    class UStaticMesh* m_cRoofSideLoopLeft;                                           // 0x00E0 (size: 0x8)

}; // Size: 0xE8

struct FProcessEnemyEventData
{
    FName EventLabel;                                                                 // 0x0000 (size: 0x8)
    int32 EventFlagBegin;                                                             // 0x0008 (size: 0x4)
    int32 EventFlagEnd;                                                               // 0x000C (size: 0x4)
    FName PlayingMainStoryLabel;                                                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FProcessItemNum : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<int32> NumTable;                                                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPurchaseItemInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName ItemLabel;                                                                  // 0x000C (size: 0x8)
    int32 FCPrice;                                                                    // 0x0014 (size: 0x4)
    FName PossibleItemLabel;                                                          // 0x0018 (size: 0x8)
    int32 ObtainFlag;                                                                 // 0x0020 (size: 0x4)
    int32 ProperSteal;                                                                // 0x0024 (size: 0x4)
    int32 ProperBeg;                                                                  // 0x0028 (size: 0x4)
    ELineupTime LineupTime;                                                           // 0x002C (size: 0x1)
    TArray<int32> VisibleFlags;                                                       // 0x0030 (size: 0x10)
    TArray<int32> HiddenFlags;                                                        // 0x0040 (size: 0x10)
    FName MillionaireModeLavel;                                                       // 0x0050 (size: 0x8)
    bool IsUnlimited;                                                                 // 0x0058 (size: 0x1)
    bool BeSoldOut;                                                                   // 0x0059 (size: 0x1)

}; // Size: 0x60

struct FPurchaseListItem : public FTableRowBase
{
    int32 PurchaseIndex;                                                              // 0x0008 (size: 0x4)
    class UTexture2D* ItemIcon;                                                       // 0x0010 (size: 0x8)
    FText ItemListNameText;                                                           // 0x0018 (size: 0x18)
    FText ItemDialogNameText;                                                         // 0x0030 (size: 0x18)
    FText PriceText;                                                                  // 0x0048 (size: 0x18)
    FText InHandText;                                                                 // 0x0060 (size: 0x18)
    FLinearColor PriceTextColor;                                                      // 0x0078 (size: 0x10)
    bool ShowPriceUnit;                                                               // 0x0088 (size: 0x1)
    int32 Price;                                                                      // 0x008C (size: 0x4)
    bool IsSelect;                                                                    // 0x0090 (size: 0x1)
    int32 StealProbability;                                                           // 0x0094 (size: 0x4)
    bool IsBonusLottery;                                                              // 0x0098 (size: 0x1)
    FName ItemLabel;                                                                  // 0x009C (size: 0x8)

}; // Size: 0xA8

struct FRadarMapDestinationData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName MainStoryTask;                                                              // 0x000C (size: 0x8)
    FName levelName;                                                                  // 0x0014 (size: 0x8)
    LEVEL_AREA_TYPE LevelAreaType;                                                    // 0x001C (size: 0x1)
    TArray<FDestinationData> DestinationList;                                         // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FRadarMapDisplayData
{
    FName PlacementLabel;                                                             // 0x0000 (size: 0x8)
    EOBJ_TYPE ObjectType;                                                             // 0x0008 (size: 0x1)
    FVector Location;                                                                 // 0x000C (size: 0xC)
    ETIMEZONE_TRIGGER_TYPE TimezoneType;                                              // 0x0018 (size: 0x1)
    int32 IconIndex;                                                                  // 0x001C (size: 0x4)
    FName EventLabel;                                                                 // 0x0020 (size: 0x8)
    EEventKind EventKind;                                                             // 0x0028 (size: 0x1)

}; // Size: 0x2C

struct FRadarMapIconParam
{
    uint8 IconType;                                                                   // 0x0000 (size: 0x1)
    ERADARMAP_ICON_OBJ_TYPE ObjType;                                                  // 0x0001 (size: 0x1)
    FName IconName;                                                                   // 0x0004 (size: 0x8)
    FName NextFieldName;                                                              // 0x000C (size: 0x8)
    FName RegistObjectName;                                                           // 0x0014 (size: 0x8)
    uint8 LevelTriggerID;                                                             // 0x001C (size: 0x1)
    FVector Position;                                                                 // 0x0020 (size: 0xC)
    EGameColor GameColorType;                                                         // 0x002C (size: 0x1)
    EGameColor RippleColorType;                                                       // 0x002D (size: 0x1)
    int32 TargetFrameIndex;                                                           // 0x0030 (size: 0x4)
    int32 TreasureBoxIndex;                                                           // 0x0034 (size: 0x4)
    bool IsVisibility;                                                                // 0x0038 (size: 0x1)
    int32 TargetCharaID;                                                              // 0x003C (size: 0x4)
    FName DestinationLabel;                                                           // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FRadarMapNextTargetData
{
    bool IsFirstTrigger;                                                              // 0x0000 (size: 0x1)
    uint8 NextTriggerID;                                                              // 0x0001 (size: 0x1)
    FName ProgressLabel;                                                              // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FRadarMapSubStoryData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 StartEventFlag;                                                             // 0x000C (size: 0x4)
    int32 EndEventFlag;                                                               // 0x0010 (size: 0x4)
    FName TargetLevelLabel;                                                           // 0x0014 (size: 0x8)
    ESUB_STORY_RADAR_ICON_TYPE RadarMapIconType;                                      // 0x001C (size: 0x1)
    TArray<ELevelTriggerID> TriggerID;                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FRandomItemData
{
    FName ItemLabel;                                                                  // 0x0000 (size: 0x8)
    int32 ItemNum;                                                                    // 0x0008 (size: 0x4)
    int32 Rate;                                                                       // 0x000C (size: 0x4)

}; // Size: 0x10

struct FRareEnemyParam
{
    bool RareEnemyFlag;                                                               // 0x0000 (size: 0x1)
    int32 RareEnemyRate;                                                              // 0x0004 (size: 0x4)
    int32 RareEnemyCnt_Low;                                                           // 0x0008 (size: 0x4)
    int32 RareEnemyCnt_Middle;                                                        // 0x000C (size: 0x4)
    int32 RareEnemyCnt_High;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FRefereshFlagChangeParam
{
    FName FlagLabel;                                                                  // 0x0000 (size: 0x8)
    bool FlagStaus;                                                                   // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FRelatedFlagSection
{
    int32 Begin;                                                                      // 0x0000 (size: 0x4)
    int32 End;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FReminiscenceBuf_EquipAbility
{
    TArray<int32> Support;                                                            // 0x0000 (size: 0x10)
    TArray<FAcquisitionAbilityData> AbilityList;                                      // 0x0010 (size: 0x10)
    FAcquisitionAbilityData AdvancedAbility;                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FReminiscenceBufferAbility : public FReminiscenceBufferBase
{
    TArray<FReminiscenceBuf_EquipAbility> Org_EquipAbility;                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferBase
{
}; // Size: 0x8

struct FReminiscenceBufferDopingParam : public FReminiscenceBufferBase
{
    TArray<FCharacterParam> Org_DopingParam;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferEquipment : public FReminiscenceBufferBase
{
    TArray<FSaveEquipmentDataID> Org_Equipment;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferExp : public FReminiscenceBufferBase
{
    TArray<int32> Org_Exp;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferFollowNpc : public FReminiscenceBufferBase
{
    TArray<FSaveFollowNpcData> Org_FollowNpc;                                         // 0x0008 (size: 0x10)
    TArray<FSaveFollowNpcData> Org_FollowWaitingNpc;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FReminiscenceBufferItem : public FReminiscenceBufferBase
{
    TArray<int32> Org_ItemID;                                                         // 0x0008 (size: 0x10)
    TArray<int32> Org_ItemNum;                                                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FReminiscenceBufferJP : public FReminiscenceBufferBase
{
    TArray<int32> Org_JP;                                                             // 0x0008 (size: 0x10)
    TArray<int32> Start_JP;                                                           // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FReminiscenceBufferJob : public FReminiscenceBufferBase
{
    TArray<int32> Org_SecondJobId;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferLearnAbility : public FReminiscenceBufferBase
{
    TArray<int32> Org_LearnAbility;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferMoney : public FReminiscenceBufferBase
{
    int32 Org_Money;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FReminiscenceBufferPOT : public FReminiscenceBufferBase
{
    TArray<int32> Org_POT;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReminiscenceBufferTameMonster : public FReminiscenceBufferBase
{
    TArray<FTameMonsterData> Org_TameMonster;                                         // 0x0008 (size: 0x10)
    TArray<FTameMonsterData> Org_LegendTameMonster;                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FReminiscenceBufferTimeZone : public FReminiscenceBufferBase
{
    ETimeZoneType Org_TimeZoneType;                                                   // 0x0008 (size: 0x1)
    int32 Org_TimeZonePos;                                                            // 0x000C (size: 0x4)
    ELEVEL_DARK_STATE Org_LevelDarkState;                                             // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FReminiscenceCharaData
{
    EPlayableCharacterID StartCharaID;                                                // 0x0000 (size: 0x1)
    EPlayableCharacterID MergeCharaID;                                                // 0x0001 (size: 0x1)
    int32 Level;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FReminiscenceMergeSetting : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<EREMINISCENCE_MERGE_TYPE> MergeType;                                       // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FReminiscenceRestorePlacement
{
    EKSCharacterMoveMode MoveMode;                                                    // 0x0000 (size: 0x1)
    FVector LadderUpEndPos;                                                           // 0x0004 (size: 0xC)
    FVector LadderDownEndPos;                                                         // 0x0010 (size: 0xC)
    FVector MoveLadderPosition;                                                       // 0x001C (size: 0xC)
    FVector PlayerLocation;                                                           // 0x0028 (size: 0xC)
    int32 EncountTriggerId;                                                           // 0x0034 (size: 0x4)
    FEquipLanternData EquipLantern;                                                   // 0x0038 (size: 0x20)
    TArray<int32> EnableSwitchIndoorTrigger;                                          // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FReminiscenceSetting : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    bool IsPrologue;                                                                  // 0x000C (size: 0x1)
    TArray<FReminiscenceCharaData> CharacterData;                                     // 0x0010 (size: 0x10)
    int32 FirstMoney;                                                                 // 0x0020 (size: 0x4)
    TArray<FName> FirstBackpackItemLabel;                                             // 0x0028 (size: 0x10)
    TArray<int32> FirstBackpackItemNum;                                               // 0x0038 (size: 0x10)
    TArray<FName> ItemOnSkipReminiscence;                                             // 0x0048 (size: 0x10)
    FName MergeSettingLabel;                                                          // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FRequestActionOrderData
{
    EACTION_ORDER_TYPE m_eOrderType;                                                  // 0x0000 (size: 0x1)
    float m_fDelayRatio;                                                              // 0x0004 (size: 0x4)
    bool m_bUseIcon;                                                                  // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FRevivalObjectSaveData
{
    int32 ObjectId;                                                                   // 0x0000 (size: 0x4)
    int32 CurrentLevelChangeCount;                                                    // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FRowNameIdSet
{
    TMap<int32, FName> IdToRowName;                                                   // 0x0000 (size: 0x50)
    TMap<FName, int32> RowNameToId;                                                   // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FSaveBackPackItem
{
    int32 ItemId;                                                                     // 0x0000 (size: 0x4)
    int32 Num;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSaveDataGuild
{
    int32 GuildId;                                                                    // 0x0000 (size: 0x4)
    int32 AcquiredLicense;                                                            // 0x0004 (size: 0x4)
    bool Visited;                                                                     // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSaveDataSubTitle
{
    int32 SubTitleId;                                                                 // 0x0000 (size: 0x4)
    int32 StartIndex;                                                                 // 0x0004 (size: 0x4)
    bool ViewFlag;                                                                    // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSaveEnemyData
{
    bool IsAnalyse;                                                                   // 0x0000 (size: 0x1)
    int32 WeaknessOpen;                                                               // 0x0004 (size: 0x4)
    bool IsPreparation;                                                               // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSaveEquipmentData : public FTableRowBase
{
    FName Sword;                                                                      // 0x0008 (size: 0x8)
    FName Lance;                                                                      // 0x0010 (size: 0x8)
    FName Dagger;                                                                     // 0x0018 (size: 0x8)
    FName Axe;                                                                        // 0x0020 (size: 0x8)
    FName Bow;                                                                        // 0x0028 (size: 0x8)
    FName Rod;                                                                        // 0x0030 (size: 0x8)
    FName Shield;                                                                     // 0x0038 (size: 0x8)
    FName Head;                                                                       // 0x0040 (size: 0x8)
    FName Body;                                                                       // 0x0048 (size: 0x8)
    FName Accessory_00;                                                               // 0x0050 (size: 0x8)
    FName Accessory_01;                                                               // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FSaveEquipmentDataID
{
    int32 Sword;                                                                      // 0x0000 (size: 0x4)
    bool SwordFixed;                                                                  // 0x0004 (size: 0x1)
    int32 Lance;                                                                      // 0x0008 (size: 0x4)
    bool LanceFixed;                                                                  // 0x000C (size: 0x1)
    int32 Dagger;                                                                     // 0x0010 (size: 0x4)
    bool DaggerFixed;                                                                 // 0x0014 (size: 0x1)
    int32 Axe;                                                                        // 0x0018 (size: 0x4)
    bool AxeFixed;                                                                    // 0x001C (size: 0x1)
    int32 Bow;                                                                        // 0x0020 (size: 0x4)
    bool BowFixed;                                                                    // 0x0024 (size: 0x1)
    int32 Rod;                                                                        // 0x0028 (size: 0x4)
    bool RodFixed;                                                                    // 0x002C (size: 0x1)
    int32 Shield;                                                                     // 0x0030 (size: 0x4)
    bool ShieldFixed;                                                                 // 0x0034 (size: 0x1)
    int32 Head;                                                                       // 0x0038 (size: 0x4)
    bool HeadFixed;                                                                   // 0x003C (size: 0x1)
    int32 Body;                                                                       // 0x0040 (size: 0x4)
    bool BodyFixed;                                                                   // 0x0044 (size: 0x1)
    int32 Accessory_00;                                                               // 0x0048 (size: 0x4)
    bool Accessory_00_Fixed;                                                          // 0x004C (size: 0x1)
    int32 Accessory_01;                                                               // 0x0050 (size: 0x4)
    bool Accessory_01_Fixed;                                                          // 0x0054 (size: 0x1)

}; // Size: 0x58

struct FSaveFollowNpcData
{
    int32 NpcUniqueID;                                                                // 0x0000 (size: 0x4)
    int32 SupportLimit;                                                               // 0x0004 (size: 0x4)
    int32 FieldCommandType;                                                           // 0x0008 (size: 0x4)
    int32 MasterCharacterID;                                                          // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSaveMissionData
{
    TArray<int32> MissionState;                                                       // 0x0000 (size: 0x10)
    TArray<int32> ClearIndex;                                                         // 0x0010 (size: 0x10)
    TArray<bool> SubMissionNewFlag;                                                   // 0x0020 (size: 0x10)
    TArray<FSubMissionMarkerData> SubMissionMaker;                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FSavePlayerCharacterData
{
    int32 CharacterID;                                                                // 0x0000 (size: 0x4)
    int32 Level;                                                                      // 0x0004 (size: 0x4)
    int32 Exp;                                                                        // 0x0008 (size: 0x4)
    int32 RawHP;                                                                      // 0x000C (size: 0x4)
    int32 RawMP;                                                                      // 0x0010 (size: 0x4)
    int32 RawPOT;                                                                     // 0x0014 (size: 0x4)
    int32 FirstJobID;                                                                 // 0x0018 (size: 0x4)
    int32 SecondJobID;                                                                // 0x001C (size: 0x4)
    int32 JobPoint;                                                                   // 0x0020 (size: 0x4)
    FSaveEquipmentDataID Equipment;                                                   // 0x0024 (size: 0x58)
    TArray<int32> EquipSupportSkill;                                                  // 0x0080 (size: 0x10)
    TArray<FAcquisitionAbilityData> AcquisitionAbilityList;                           // 0x0090 (size: 0x10)
    FAcquisitionAbilityData AcquisitionAdvancedAbility;                               // 0x00A0 (size: 0x10)
    FCharacterParam DopingParam;                                                      // 0x00B0 (size: 0x34)
    int32 PlayingMainStoryID;                                                         // 0x00E4 (size: 0x4)
    int32 InterruptedMainStoryID;                                                     // 0x00E8 (size: 0x4)
    int32 MainMissionProgressCnt;                                                     // 0x00EC (size: 0x4)

}; // Size: 0xF0

struct FSeVibrationData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FSearchInfomationData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString InfoText;                                                                 // 0x0010 (size: 0x10)
    int32 AccessPoint;                                                                // 0x0020 (size: 0x4)
    bool IsEffective;                                                                 // 0x0024 (size: 0x1)
    FString NotificationText;                                                         // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FSearchRelationInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TArray<int32> PersonalInfoList;                                                   // 0x0010 (size: 0x10)
    TArray<int32> DiagramList;                                                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSequencerResourceData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    TSoftObjectPtr<UObject> ResourcePath;                                             // 0x0010 (size: 0x28)

}; // Size: 0x38

struct FShieldChangeData : public FTableRowBase
{
    int32 m_nShieldPointMax;                                                          // 0x0008 (size: 0x4)
    FName m_strInfomationText;                                                        // 0x000C (size: 0x8)

}; // Size: 0x18

struct FShopInfoData : public FTableRowBase
{
    FName ShopName;                                                                   // 0x0008 (size: 0x8)
    ESHOP_TYPE ShopType;                                                              // 0x0010 (size: 0x1)
    FName ShopBGM;                                                                    // 0x0014 (size: 0x8)
    int32 InnBasePrice;                                                               // 0x001C (size: 0x4)
    FName InnDiscountItem;                                                            // 0x0020 (size: 0x8)
    int32 InnDiscountBasePrice;                                                       // 0x0028 (size: 0x4)
    int32 ID;                                                                         // 0x002C (size: 0x4)

}; // Size: 0x30

struct FSimpleActionLoad
{
    FName CharaResLabel;                                                              // 0x0000 (size: 0x8)
    TArray<EKSCharacterAction> ActionLabels;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSkillInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 Name;                                                                       // 0x000C (size: 0x4)
    int32 Detail;                                                                     // 0x0010 (size: 0x4)
    int32 InvokeType;                                                                 // 0x0014 (size: 0x4)
    TArray<float> Values;                                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSoldOutShopItemData
{
    bool IsSoldOut;                                                                   // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FSoundData : public FTableRowBase
{
    class USoundAtomCue* SoundCri;                                                    // 0x0008 (size: 0x8)
    FName BgmLabel;                                                                   // 0x0010 (size: 0x8)
    int32 BGMID;                                                                      // 0x0018 (size: 0x4)
    int32 Priority;                                                                   // 0x001C (size: 0x4)
    float FadeIn;                                                                     // 0x0020 (size: 0x4)
    float FadeOut;                                                                    // 0x0024 (size: 0x4)
    float Volume;                                                                     // 0x0028 (size: 0x4)
    float Time;                                                                       // 0x002C (size: 0x4)
    int32 StateChangeBgm;                                                             // 0x0030 (size: 0x4)
    class UAtomComponent* TargetSoundComponent;                                       // 0x0038 (size: 0x8)
    bool IsInterupt;                                                                  // 0x0040 (size: 0x1)
    bool IsPlayedMusicRecord;                                                         // 0x0041 (size: 0x1)

}; // Size: 0x48

struct FSoundSEData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString Label;                                                                    // 0x0010 (size: 0x10)
    FName CueSheetName;                                                               // 0x0020 (size: 0x8)
    TSoftObjectPtr<USoundAtomCue> Resource;                                           // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FSoundVoiceData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString Label;                                                                    // 0x0010 (size: 0x10)
    FName CueSheetName;                                                               // 0x0020 (size: 0x8)
    TSoftObjectPtr<USoundAtomCue> Resource;                                           // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FSpActMerchantResult
{
    ESPACT_MER_RESULT_TYPE Result;                                                    // 0x0000 (size: 0x1)
    FName ResultTextLabel;                                                            // 0x0004 (size: 0x8)
    FString ResultTextLabel_Param0;                                                   // 0x0010 (size: 0x10)
    int32 PriceBefore;                                                                // 0x0020 (size: 0x4)
    int32 PriceAfter;                                                                 // 0x0024 (size: 0x4)
    TArray<FName> AcquiredItemLabel;                                                  // 0x0028 (size: 0x10)
    TArray<int32> AcquiredItemNum;                                                    // 0x0038 (size: 0x10)
    int32 NPCID;                                                                      // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FSpActionMerchant_Data : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    ESPACT_MERCHANT_TYPE SPEffectType;                                                // 0x000C (size: 0x1)
    FName SPEffectName;                                                               // 0x0010 (size: 0x8)
    FName SPEffectOverView;                                                           // 0x0018 (size: 0x8)
    FName ResultTextSuccess;                                                          // 0x0020 (size: 0x8)
    FName ResultTextFailure;                                                          // 0x0028 (size: 0x8)
    TArray<int32> EffectIntParam;                                                     // 0x0030 (size: 0x10)
    TArray<FName> EffectItemLabel;                                                    // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FSpActionMerchant_MenuData
{
    int32 SPActionID;                                                                 // 0x0000 (size: 0x4)
    FText SPActionName;                                                               // 0x0008 (size: 0x18)
    ESPACT_MERCHANT_TYPE EffectType;                                                  // 0x0020 (size: 0x1)
    FText EffectOverview;                                                             // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FSpActionMerchant_Type : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 ResultParamType;                                                            // 0x000C (size: 0x4)
    TArray<bool> ExecTrigger;                                                         // 0x0010 (size: 0x10)
    FName EffectDescription;                                                          // 0x0020 (size: 0x8)
    TArray<ESPACT_MER_DESC_PARAM_TYPE> DescTextParam;                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FSpecialAbilityInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 DesplayName;                                                                // 0x000C (size: 0x4)
    int32 Detail;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSpecialActionData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName MenuName;                                                                   // 0x000C (size: 0x8)
    FName MenuDetail;                                                                 // 0x0014 (size: 0x8)
    FName BattleCommandName;                                                          // 0x001C (size: 0x8)
    FName BattleCommandDetail;                                                        // 0x0024 (size: 0x8)
    FName PlayerSelectDetail;                                                         // 0x002C (size: 0x8)
    FString SpecialActionType;                                                        // 0x0038 (size: 0x10)
    TArray<FName> AbilityID;                                                          // 0x0048 (size: 0x10)
    bool UniqueCommandFlag;                                                           // 0x0058 (size: 0x1)
    int32 BanFlag;                                                                    // 0x005C (size: 0x4)

}; // Size: 0x60

struct FSpecialItemData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    ESPECIAL_ITEM_TYPE SpecialType;                                                   // 0x000C (size: 0x1)
    bool UsableSpItem;                                                                // 0x000D (size: 0x1)
    int32 ShowInItemListFlag;                                                         // 0x0010 (size: 0x4)
    int32 HideInItemListFlag;                                                         // 0x0014 (size: 0x4)
    EPlayableCharacterID RelativeCharacterId;                                         // 0x0018 (size: 0x1)
    FName RelativeItemLabel;                                                          // 0x001C (size: 0x8)
    FName BgmLabel;                                                                   // 0x0024 (size: 0x8)
    TArray<FName> CommonText;                                                         // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FStaffCreditPartsTable : public FTableRowBase
{
    ECreditAlignment Alignment;                                                       // 0x0008 (size: 0x1)
    ECreditFontColor FontColor;                                                       // 0x0009 (size: 0x1)
    ECreditFontType FontType;                                                         // 0x000A (size: 0x1)
    ECreditFontSize FontSize;                                                         // 0x000B (size: 0x1)

}; // Size: 0x10

struct FStaffCreditStyleTable : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    ECreditAlignment Alignment;                                                       // 0x000C (size: 0x1)
    ECreditFontColor FontColor;                                                       // 0x000D (size: 0x1)
    ECreditFontType FontType;                                                         // 0x000E (size: 0x1)
    ECreditFontSize FontSize;                                                         // 0x000F (size: 0x1)

}; // Size: 0x10

struct FStaffCreditTable : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    ECreditWidgetType PartsType;                                                      // 0x000C (size: 0x1)
    FName Style;                                                                      // 0x0010 (size: 0x8)
    TArray<FString> Resource;                                                         // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FStartWorldMapData
{
    FName WMapLocation;                                                               // 0x0000 (size: 0x8)
    TArray<FName> RelationLevel;                                                      // 0x0008 (size: 0x10)
    int32 StartFlag;                                                                  // 0x0018 (size: 0x4)
    int32 EndFlag;                                                                    // 0x001C (size: 0x4)

}; // Size: 0x20

struct FStoryRecordTaskInfo
{
    TArray<FMAINMENU_MISSION_RECORD_DATA> StoryRecordList;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSubMissionData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 AreaIndex;                                                                  // 0x000C (size: 0x4)
    ESUB_STORY_CATEGORY StoryCategory;                                                // 0x0010 (size: 0x1)
    int32 MissionIndex;                                                               // 0x0014 (size: 0x4)
    FName WorldMapIcon;                                                               // 0x0018 (size: 0x8)
    TArray<EPlayableCharacterID> StartConditionParty;                                 // 0x0020 (size: 0x10)
    FName TitleTextLabel;                                                             // 0x0030 (size: 0x8)
    FName DetailTextLabel;                                                            // 0x0038 (size: 0x8)
    TArray<FName> ClearTextLabel;                                                     // 0x0040 (size: 0x10)
    FName NPCName;                                                                    // 0x0050 (size: 0x8)
    FName NPCLabel;                                                                   // 0x0058 (size: 0x8)
    int32 RewardMoney;                                                                // 0x0060 (size: 0x4)
    TArray<FName> RewardParam;                                                        // 0x0068 (size: 0x10)
    FName RelatedMainStoryTask;                                                       // 0x0078 (size: 0x8)
    TArray<FRelatedFlagSection> RelatedFlagSections;                                  // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FSubMissionMarkerData
{
    int32 MapID;                                                                      // 0x0000 (size: 0x4)
    FVector MarkerPos;                                                                // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FSubSeqData
{
    class ALevelSequenceActor* Sequence;                                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSubTitleBlockData
{
    FName TalkLabel;                                                                  // 0x0000 (size: 0x8)
    float ViewTime;                                                                   // 0x0008 (size: 0x4)
    float WaitTime;                                                                   // 0x000C (size: 0x4)
    int32 BlockIndex;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FSubTitleDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    float MapInWaitTime;                                                              // 0x000C (size: 0x4)
    float FadeInTime;                                                                 // 0x0010 (size: 0x4)
    float FadeOutTime;                                                                // 0x0014 (size: 0x4)
    FName BeginMainStoryTaskLabel;                                                    // 0x0018 (size: 0x8)
    FName EndMainStoryTaskLabel;                                                      // 0x0020 (size: 0x8)
    bool UseBackground;                                                               // 0x0028 (size: 0x1)
    TArray<FSubTitleBlockData> BlockData;                                             // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FSupportAbilityDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 SupportAbilityID;                                                           // 0x000C (size: 0x4)
    FName DisplayName;                                                                // 0x0010 (size: 0x8)
    FName Detail;                                                                     // 0x0018 (size: 0x8)
    ESUPPORT_AILMENT_TYPE SupportAilmentType;                                         // 0x0020 (size: 0x1)
    int32 InvocationValue;                                                            // 0x0024 (size: 0x4)
    int32 AddtionalInVocationValue00;                                                 // 0x0028 (size: 0x4)
    int32 AddtionalInVocationValue01;                                                 // 0x002C (size: 0x4)
    int32 AddtionalInVocationValue02;                                                 // 0x0030 (size: 0x4)
    FName ExecAbilityLabel;                                                           // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FSupportCharacterData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    int32 SupporterID;                                                                // 0x000C (size: 0x4)
    FName DisplayNameID;                                                              // 0x0010 (size: 0x8)
    int32 DisplayRank;                                                                // 0x0018 (size: 0x4)
    FName ActionLabel;                                                                // 0x001C (size: 0x8)
    int32 SupportPoint;                                                               // 0x0024 (size: 0x4)
    bool IsUnlimitedSupporter;                                                        // 0x0028 (size: 0x1)
    int32 SupportLimit;                                                               // 0x002C (size: 0x4)
    FCharacterParam Parameter;                                                        // 0x0030 (size: 0x34)
    EWEAPON_CATEGORY WeaponType;                                                      // 0x0064 (size: 0x1)
    EWEAPON_STANCE WeaponStance;                                                      // 0x0065 (size: 0x1)
    FName WeaponItemLabel;                                                            // 0x0068 (size: 0x8)
    int32 CoverRate;                                                                  // 0x0070 (size: 0x4)
    TSoftClassPtr<UBattleAIBase> SupporterAI;                                         // 0x0078 (size: 0x28)
    TArray<FSupporterCommandData> CommandTable;                                       // 0x00A0 (size: 0x10)
    FName SessionAbility;                                                             // 0x00B0 (size: 0x8)

}; // Size: 0xB8

struct FSupporterCommandData
{
    FName CommandName;                                                                // 0x0000 (size: 0x8)
    int32 Rate;                                                                       // 0x0008 (size: 0x4)
    int32 Cost;                                                                       // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSwitchIndoorTriggerParam : public FTableRowBase
{
    float fCameraDistanceIndoor;                                                      // 0x0008 (size: 0x4)
    float fManualFocusDistanceIndoor;                                                 // 0x000C (size: 0x4)
    float fManualFocusDistanceOutdoor;                                                // 0x0010 (size: 0x4)
    float fCharacterScaleIndoor;                                                      // 0x0014 (size: 0x4)
    float fCharacterScaleOutdoor;                                                     // 0x0018 (size: 0x4)
    float fCharacterHeightIndoor;                                                     // 0x001C (size: 0x4)
    float fCharacterHeightOutdoor;                                                    // 0x0020 (size: 0x4)
    int32 nIndoorFloorNum;                                                            // 0x0024 (size: 0x4)
    int32 nOutdoorFloorNum;                                                           // 0x0028 (size: 0x4)
    bool bForceOutdoor;                                                               // 0x002C (size: 0x1)
    int32 nProcessOrder;                                                              // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FTalkText : public FTableRowBase
{
    EBalloonType Type;                                                                // 0x0008 (size: 0x1)
    TArray<bool> Reset;                                                               // 0x0010 (size: 0x10)
    TArray<int32> Height;                                                             // 0x0020 (size: 0x10)
    TArray<int32> Width;                                                              // 0x0030 (size: 0x10)
    TArray<FName> Names;                                                              // 0x0040 (size: 0x10)
    TArray<FString> Text;                                                             // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FTalkVoice : public FTableRowBase
{
    TArray<FName> Voice;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FTameMonsterData
{
    int32 EnemyID;                                                                    // 0x0000 (size: 0x4)
    int32 Count;                                                                      // 0x0004 (size: 0x4)
    bool Used;                                                                        // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FTimeZoneSaveData
{
    ETimeZoneType m_eTimeZoneType;                                                    // 0x0000 (size: 0x1)
    int32 m_nTimeZoneChangeValue;                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FTownData
{
    int32 ConnectionValue;                                                            // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FTownInfoData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName TownLabel;                                                                  // 0x000C (size: 0x8)
    FName TownName;                                                                   // 0x0014 (size: 0x8)
    int32 ConnectionInit;                                                             // 0x001C (size: 0x4)
    int32 ConnectionMax;                                                              // 0x0020 (size: 0x4)
    int32 ConnectionPrice;                                                            // 0x0024 (size: 0x4)
    TArray<float> ConnectionRate;                                                     // 0x0028 (size: 0x10)
    FFieldCommandAssistItem StealFcAssistItem;                                        // 0x0038 (size: 0xC)
    FFieldCommandAssistItem BattleFcAssistItem;                                       // 0x0044 (size: 0xC)
    FFieldCommandAssistItem MonsterFcAssistItem;                                      // 0x0050 (size: 0xC)
    FFieldCommandAssistItem LeadFcAssistItem;                                         // 0x005C (size: 0xC)
    FFieldCommandAssistItem LureFcAssistItem;                                         // 0x0068 (size: 0xC)
    FFieldCommandAssistItem HearFcAssistItem;                                         // 0x0074 (size: 0xC)
    FFieldCommandAssistItem HireFcAssistItem;                                         // 0x0080 (size: 0xC)
    FFieldCommandAssistItem RobFcAssistItem;                                          // 0x008C (size: 0xC)

}; // Size: 0x98

struct FTransitionData
{
    TArray<EMAINSEQ_TYPE> NextFlowData;                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FTransportCameraParam
{
    FVector CameraLocationOffset;                                                     // 0x0000 (size: 0xC)
    FRotator CameraRotation;                                                          // 0x000C (size: 0xC)
    FVector CharacterScale;                                                           // 0x0018 (size: 0xC)
    FCameraFilmbackSettings Filmback;                                                 // 0x0024 (size: 0xC)
    FCameraLensSettings LensSettings;                                                 // 0x0030 (size: 0x18)
    FCameraFocusSettings FocusSettings;                                               // 0x0048 (size: 0x58)
    float CurrentFocalLength;                                                         // 0x00A0 (size: 0x4)
    float CurrentAperture;                                                            // 0x00A4 (size: 0x4)

}; // Size: 0xA8

struct FTutorialFlagPart : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    ETUTORIAL_TYPE TutorialType;                                                      // 0x000C (size: 0x1)
    int32 TutorialListFlag;                                                           // 0x0010 (size: 0x4)
    int32 TutorialOpenedFlag;                                                         // 0x0014 (size: 0x4)
    TArray<FName> PageDataLabel;                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FUIButtonData : public FTableRowBase
{
    class UImage* Image_Active;                                                       // 0x0008 (size: 0x8)
    class UImage* Image_DeActive;                                                     // 0x0010 (size: 0x8)
    class UButton* Button;                                                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FUIResourceData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EUIResType ResType;                                                               // 0x000C (size: 0x1)
    EUIResCategory Category;                                                          // 0x000D (size: 0x1)
    TArray<TSoftObjectPtr<UObject>> ResList;                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FUIResourceReferenceData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EUIResType ResType;                                                               // 0x000C (size: 0x1)
    EUIResCategory Category;                                                          // 0x000D (size: 0x1)
    TArray<int32> ResMap;                                                             // 0x0010 (size: 0x10)
    TArray<int32> LangMap;                                                            // 0x0020 (size: 0x10)
    TMap<int32, TSoftObjectPtr<UObject>> AssetMap;                                    // 0x0030 (size: 0x50)

}; // Size: 0x80

struct FUIWidgetReferenceData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FString BaseClassPath;                                                            // 0x0010 (size: 0x10)
    TSoftObjectPtr<UObject> InstancePath;                                             // 0x0020 (size: 0x28)
    int32 ZOrder;                                                                     // 0x0048 (size: 0x4)
    EWIDGET_CREATE_PHASE CreatePhase;                                                 // 0x004C (size: 0x1)
    bool IsAddViewport;                                                               // 0x004D (size: 0x1)

}; // Size: 0x50

struct FVectorsToIcon
{
    FVector2D BetweenIconAndCursor;                                                   // 0x0000 (size: 0x8)
    FVector2D BetweenIconAndAreaLabel;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWeakChangeData : public FTableRowBase
{
    int32 m_eWeakAttributeType;                                                       // 0x0008 (size: 0x4)
    FName m_strInfomationText;                                                        // 0x000C (size: 0x8)

}; // Size: 0x18

struct FWeakLockData : public FTableRowBase
{
    int32 m_eWeakLockType;                                                            // 0x0008 (size: 0x4)
    FName m_strInfomationText;                                                        // 0x000C (size: 0x8)

}; // Size: 0x18

struct FWeaponMasterEventDataBase : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    FName EventLabel;                                                                 // 0x000C (size: 0x8)
    FName DialogText;                                                                 // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FWeaponTexutreUnloadManage
{
    TArray<FName> m_strLoadWeaponLabel;                                               // 0x0000 (size: 0x10)
    TArray<FName> m_strUnLoadWaitWeaponLabel;                                         // 0x0010 (size: 0x10)
    EWEAPON_UNLOAD_GC_TYPE m_eUnlaodGCType;                                           // 0x0020 (size: 0x1)
    uint8 m_uUnloadWeaponCnt;                                                         // 0x0021 (size: 0x1)
    uint8 m_uUnloadWeaponCntMax;                                                      // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FWidgetAnimationGroupData
{
    TArray<class UWidgetAnimation*> Animations;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWidgetFlipbookAnimeInfo : public FTableRowBase
{
    EKSCharacterAction Action;                                                        // 0x0008 (size: 0x1)
    EKSCharacterDir Dir;                                                              // 0x0009 (size: 0x1)
    FVector2D DrawSize;                                                               // 0x000C (size: 0x8)

}; // Size: 0x18

struct FWidgetTemporaryHiddenData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EWIDGET_TEMPORARY_HIDE_USER HiddenUser;                                           // 0x000C (size: 0x1)
    TArray<EKSUIKind> UiList;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWorldMapDarkAreaEffectParam : public FTableRowBase
{
    FName WorldMapLabel;                                                              // 0x0008 (size: 0x8)
    FName DarkAreaLabel;                                                              // 0x0010 (size: 0x8)
    EWorldMapEffectType EffectType;                                                   // 0x0018 (size: 0x1)
    FVector LocationOffset;                                                           // 0x001C (size: 0xC)
    FRotator RotationOffset;                                                          // 0x0028 (size: 0xC)
    FVector ScaleOffset;                                                              // 0x0034 (size: 0xC)

}; // Size: 0x40

struct FWorldMapDestinationData
{
    FName WorldMapLocation;                                                           // 0x0000 (size: 0x8)
    FName WorldMapDestination;                                                        // 0x0008 (size: 0x8)
    EMAIN_STORY_CATEGORY StoryCategory;                                               // 0x0010 (size: 0x1)
    int32 ChapterNumber;                                                              // 0x0014 (size: 0x4)
    FName ChapterText;                                                                // 0x0018 (size: 0x8)
    EPlayableCharacterID PlayerCharaId;                                               // 0x0020 (size: 0x1)
    TArray<EPlayableCharacterID> RelationCharaId;                                     // 0x0028 (size: 0x10)
    int32 RecommendationLevel;                                                        // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FWorldMapIconData : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    bool NearVisibility;                                                              // 0x000C (size: 0x1)
    bool MiddleVisibility;                                                            // 0x000D (size: 0x1)
    bool FarVisibility;                                                               // 0x000E (size: 0x1)
    bool IsDisplayOnlyCurrentLocation;                                                // 0x000F (size: 0x1)
    FName IconTexLabel;                                                               // 0x0010 (size: 0x8)
    bool IsGuildIcon;                                                                 // 0x0018 (size: 0x1)
    bool IsShipIcon;                                                                  // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FWorldMapNameOverride
{
    FName NameLabel;                                                                  // 0x0000 (size: 0x8)
    int32 ActiveFlag;                                                                 // 0x0008 (size: 0x4)
    FName EncounterLevelLabel;                                                        // 0x000C (size: 0x8)

}; // Size: 0x14

struct FWorldMapTable : public FTableRowBase
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EWorldMapIconType MapIconType;                                                    // 0x000C (size: 0x1)
    TArray<FName> RefLevelName;                                                       // 0x0010 (size: 0x10)
    FName RegionName;                                                                 // 0x0020 (size: 0x8)
    FName MapName;                                                                    // 0x0028 (size: 0x8)
    TArray<FWorldMapNameOverride> MapNameOverrides;                                   // 0x0030 (size: 0x10)
    FName EmblemLabel;                                                                // 0x0040 (size: 0x8)
    EWorldMapMaskArea WorldMapMaskArea;                                               // 0x0048 (size: 0x1)
    EWorldMapIslandLayerArea WorldMapIslandLayerArea;                                 // 0x0049 (size: 0x1)
    EWorldMapPrologueMaskArea WorldMapPrologueMaskArea;                               // 0x004A (size: 0x1)
    FName DarkAreaLabel;                                                              // 0x004C (size: 0x8)
    bool IsAllowLostWay;                                                              // 0x0054 (size: 0x1)
    int32 VisibleFlag;                                                                // 0x0058 (size: 0x4)
    bool CanFastTravel;                                                               // 0x005C (size: 0x1)
    int32 TemporaryBanFastTravelFlag;                                                 // 0x0060 (size: 0x4)
    FName BanFastTravelInterruptMainStory;                                            // 0x0064 (size: 0x8)
    FName MoveLevelName;                                                              // 0x006C (size: 0x8)
    int32 TriggerID;                                                                  // 0x0074 (size: 0x4)
    int32 PlayerDir;                                                                  // 0x0078 (size: 0x4)
    EPlayableCharacterID PlayerCharaId;                                               // 0x007C (size: 0x1)
    int32 PlayerSwitchOrder;                                                          // 0x0080 (size: 0x4)
    FVector2D PlayerChraraPosOffset;                                                  // 0x0084 (size: 0x8)

}; // Size: 0x90

class AAchievementManager : public AAcqManagerBase
{
    class UServiceConnecter* m_Service;                                               // 0x0230 (size: 0x8)

    void OnWorldMapOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnUnLockAchievement();
    void OnTitleScene(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnSwoonNpcByFc(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnSubStoryRecordOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnSubStoryClear(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnStoryRecordReOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnStoryRecordOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnStartFieldMainSequenceAfterExBoss(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnRefreshFollowCharacter(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnPartyMemberChangeMenuOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnOpenEndCardEpilogue(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnOpenEndCard(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnMusicRecordOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnMainStoryTaskClear(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnMainStoryClear(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnJoinedCharacter(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnJobMenuOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnItemMenuOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnInformationFieldCommandOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnGetItem(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnFinishFieldCommand(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnEquipMenuOpen(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnCreatedPlayerController(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnChangeVisitedLevel(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnBreak(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnBoostAttack(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnBeginLinerShip(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnAttack(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnAcquisitionAdvancedAbility(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
    void OnAcquisitionAbility(ENOTICE_TYPE eNoticeType, const FNoticeArgs& NoticeArgs);
